RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the ERR31 field to a new value. */
#define DMA_WR_ERR_ERR31(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR31_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK), DMA_ERR_ERR31(value)))
#define DMA_BWR_ERR_ERR31(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR31_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_HRS - Hardware Request Status Register
 ******************************************************************************/

/*!
 * @brief DMA_HRS - Hardware Request Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The HRS register provides a bit map for the DMA channels, signaling the
 * presence of a hardware request for each channel. The hardware request status bits
 * reflect the current state of the register and qualified (via the ERQ fields)
 * DMA request signals as seen by the DMA's arbitration logic. This view into the
 * hardware request signals may be used for debug purposes. These bits reflect the
 * state of the request as seen by the arbitration logic. Therefore, this status
 * is affected by the ERQ bits.
 */
/*!
 * @name Constants and macros for entire DMA_HRS register
 */
/*@{*/
#define DMA_RD_HRS(base)         (DMA_HRS_REG(base))
/*@}*/

/*
 * Constants & macros for individual DMA_HRS bitfields
 */

/*!
 * @name Register DMA_HRS, field HRS0[0] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 0 is not present
 * - 0b1 - A hardware service request for channel 0 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS0 field. */
#define DMA_RD_HRS_HRS0(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS0_MASK) >> DMA_HRS_HRS0_SHIFT)
#define DMA_BRD_HRS_HRS0(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS0_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS1[1] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 1 is not present
 * - 0b1 - A hardware service request for channel 1 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS1 field. */
#define DMA_RD_HRS_HRS1(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS1_MASK) >> DMA_HRS_HRS1_SHIFT)
#define DMA_BRD_HRS_HRS1(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS1_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS2[2] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 2 is not present
 * - 0b1 - A hardware service request for channel 2 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS2 field. */
#define DMA_RD_HRS_HRS2(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS2_MASK) >> DMA_HRS_HRS2_SHIFT)
#define DMA_BRD_HRS_HRS2(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS2_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS3[3] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 3 is not present
 * - 0b1 - A hardware service request for channel 3 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS3 field. */
#define DMA_RD_HRS_HRS3(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS3_MASK) >> DMA_HRS_HRS3_SHIFT)
#define DMA_BRD_HRS_HRS3(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS3_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS4[4] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 4 is not present
 * - 0b1 - A hardware service request for channel 4 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS4 field. */
#define DMA_RD_HRS_HRS4(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS4_MASK) >> DMA_HRS_HRS4_SHIFT)
#define DMA_BRD_HRS_HRS4(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS4_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS5[5] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 5 is not present
 * - 0b1 - A hardware service request for channel 5 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS5 field. */
#define DMA_RD_HRS_HRS5(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS5_MASK) >> DMA_HRS_HRS5_SHIFT)
#define DMA_BRD_HRS_HRS5(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS5_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS6[6] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 6 is not present
 * - 0b1 - A hardware service request for channel 6 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS6 field. */
#define DMA_RD_HRS_HRS6(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS6_MASK) >> DMA_HRS_HRS6_SHIFT)
#define DMA_BRD_HRS_HRS6(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS6_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS7[7] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 7 is not present
 * - 0b1 - A hardware service request for channel 7 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS7 field. */
#define DMA_RD_HRS_HRS7(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS7_MASK) >> DMA_HRS_HRS7_SHIFT)
#define DMA_BRD_HRS_HRS7(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS7_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS8[8] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 8 is not present
 * - 0b1 - A hardware service request for channel 8 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS8 field. */
#define DMA_RD_HRS_HRS8(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS8_MASK) >> DMA_HRS_HRS8_SHIFT)
#define DMA_BRD_HRS_HRS8(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS8_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS9[9] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 9 is not present
 * - 0b1 - A hardware service request for channel 9 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS9 field. */
#define DMA_RD_HRS_HRS9(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS9_MASK) >> DMA_HRS_HRS9_SHIFT)
#define DMA_BRD_HRS_HRS9(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS9_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS10[10] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 10 is not present
 * - 0b1 - A hardware service request for channel 10 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS10 field. */
#define DMA_RD_HRS_HRS10(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS10_MASK) >> DMA_HRS_HRS10_SHIFT)
#define DMA_BRD_HRS_HRS10(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS10_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS11[11] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 11 is not present
 * - 0b1 - A hardware service request for channel 11 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS11 field. */
#define DMA_RD_HRS_HRS11(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS11_MASK) >> DMA_HRS_HRS11_SHIFT)
#define DMA_BRD_HRS_HRS11(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS11_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS12[12] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 12 is not present
 * - 0b1 - A hardware service request for channel 12 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS12 field. */
#define DMA_RD_HRS_HRS12(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS12_MASK) >> DMA_HRS_HRS12_SHIFT)
#define DMA_BRD_HRS_HRS12(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS12_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS13[13] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 13 is not present
 * - 0b1 - A hardware service request for channel 13 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS13 field. */
#define DMA_RD_HRS_HRS13(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS13_MASK) >> DMA_HRS_HRS13_SHIFT)
#define DMA_BRD_HRS_HRS13(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS13_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS14[14] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 14 is not present
 * - 0b1 - A hardware service request for channel 14 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS14 field. */
#define DMA_RD_HRS_HRS14(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS14_MASK) >> DMA_HRS_HRS14_SHIFT)
#define DMA_BRD_HRS_HRS14(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS14_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS15[15] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 15 is not present
 * - 0b1 - A hardware service request for channel 15 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS15 field. */
#define DMA_RD_HRS_HRS15(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS15_MASK) >> DMA_HRS_HRS15_SHIFT)
#define DMA_BRD_HRS_HRS15(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS15_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS16[16] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 16 is not present
 * - 0b1 - A hardware service request for channel 16 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS16 field. */
#define DMA_RD_HRS_HRS16(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS16_MASK) >> DMA_HRS_HRS16_SHIFT)
#define DMA_BRD_HRS_HRS16(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS16_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS17[17] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 17 is not present
 * - 0b1 - A hardware service request for channel 17 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS17 field. */
#define DMA_RD_HRS_HRS17(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS17_MASK) >> DMA_HRS_HRS17_SHIFT)
#define DMA_BRD_HRS_HRS17(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS17_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS18[18] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 18 is not present
 * - 0b1 - A hardware service request for channel 18 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS18 field. */
#define DMA_RD_HRS_HRS18(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS18_MASK) >> DMA_HRS_HRS18_SHIFT)
#define DMA_BRD_HRS_HRS18(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS18_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS19[19] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 19 is not present
 * - 0b1 - A hardware service request for channel 19 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS19 field. */
#define DMA_RD_HRS_HRS19(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS19_MASK) >> DMA_HRS_HRS19_SHIFT)
#define DMA_BRD_HRS_HRS19(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS19_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS20[20] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 20 is not present
 * - 0b1 - A hardware service request for channel 20 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS20 field. */
#define DMA_RD_HRS_HRS20(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS20_MASK) >> DMA_HRS_HRS20_SHIFT)
#define DMA_BRD_HRS_HRS20(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS20_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS21[21] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 21 is not present
 * - 0b1 - A hardware service request for channel 21 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS21 field. */
#define DMA_RD_HRS_HRS21(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS21_MASK) >> DMA_HRS_HRS21_SHIFT)
#define DMA_BRD_HRS_HRS21(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS21_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS22[22] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 22 is not present
 * - 0b1 - A hardware service request for channel 22 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS22 field. */
#define DMA_RD_HRS_HRS22(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS22_MASK) >> DMA_HRS_HRS22_SHIFT)
#define DMA_BRD_HRS_HRS22(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS22_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS23[23] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 23 is not present
 * - 0b1 - A hardware service request for channel 23 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS23 field. */
#define DMA_RD_HRS_HRS23(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS23_MASK) >> DMA_HRS_HRS23_SHIFT)
#define DMA_BRD_HRS_HRS23(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS23_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS24[24] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 24 is not present
 * - 0b1 - A hardware service request for channel 24 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS24 field. */
#define DMA_RD_HRS_HRS24(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS24_MASK) >> DMA_HRS_HRS24_SHIFT)
#define DMA_BRD_HRS_HRS24(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS24_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS25[25] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 25 is not present
 * - 0b1 - A hardware service request for channel 25 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS25 field. */
#define DMA_RD_HRS_HRS25(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS25_MASK) >> DMA_HRS_HRS25_SHIFT)
#define DMA_BRD_HRS_HRS25(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS25_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS26[26] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 26 is not present
 * - 0b1 - A hardware service request for channel 26 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS26 field. */
#define DMA_RD_HRS_HRS26(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS26_MASK) >> DMA_HRS_HRS26_SHIFT)
#define DMA_BRD_HRS_HRS26(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS26_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS27[27] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 27 is not present
 * - 0b1 - A hardware service request for channel 27 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS27 field. */
#define DMA_RD_HRS_HRS27(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS27_MASK) >> DMA_HRS_HRS27_SHIFT)
#define DMA_BRD_HRS_HRS27(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS27_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS28[28] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 28 is not present
 * - 0b1 - A hardware service request for channel 28 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS28 field. */
#define DMA_RD_HRS_HRS28(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS28_MASK) >> DMA_HRS_HRS28_SHIFT)
#define DMA_BRD_HRS_HRS28(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS28_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS29[29] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 29 is not preset
 * - 0b1 - A hardware service request for channel 29 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS29 field. */
#define DMA_RD_HRS_HRS29(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS29_MASK) >> DMA_HRS_HRS29_SHIFT)
#define DMA_BRD_HRS_HRS29(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS29_SHIFT))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS30[30] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 30 is not present
 * - 0b1 - A hardware service request for for channel 30 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS30 field. */
#define DMA_RD_HRS_HRS30(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS30_MASK) >> DMA_HRS_HRS30_SHIFT)
#define DMA_BRD_HRS_HRS30(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS30_SHIFT))
/*@}*/

