RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI27 bitfields
 */

/*!
 * @name Register DMA_DCHPRI27, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_CHPRI field. */
#define DMA_RD_DCHPRI27_CHPRI(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_CHPRI_MASK) >> DMA_DCHPRI27_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI27_CHPRI(base) (DMA_RD_DCHPRI27_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI27_CHPRI(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_CHPRI_MASK, DMA_DCHPRI27_CHPRI(value)))
#define DMA_BWR_DCHPRI27_CHPRI(base, value) (DMA_WR_DCHPRI27_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_GRPPRI field. */
#define DMA_RD_DCHPRI27_GRPPRI(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_GRPPRI_MASK) >> DMA_DCHPRI27_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI27_GRPPRI(base) (DMA_RD_DCHPRI27_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_DPA field. */
#define DMA_RD_DCHPRI27_DPA(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_DPA_MASK) >> DMA_DCHPRI27_DPA_SHIFT)
#define DMA_BRD_DCHPRI27_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI27_DPA(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_DPA_MASK, DMA_DCHPRI27_DPA(value)))
#define DMA_BWR_DCHPRI27_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_ECP field. */
#define DMA_RD_DCHPRI27_ECP(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_ECP_MASK) >> DMA_DCHPRI27_ECP_SHIFT)
#define DMA_BRD_DCHPRI27_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI27_ECP(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_ECP_MASK, DMA_DCHPRI27_ECP(value)))
#define DMA_BWR_DCHPRI27_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI26 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI26 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values; otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI26 register
 */
/*@{*/
#define DMA_RD_DCHPRI26(base)    (DMA_DCHPRI26_REG(base))
#define DMA_WR_DCHPRI26(base, value) (DMA_DCHPRI26_REG(base) = (value))
#define DMA_RMW_DCHPRI26(base, mask, value) (DMA_WR_DCHPRI26(base, (DMA_RD_DCHPRI26(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI26(base, value) (DMA_WR_DCHPRI26(base, DMA_RD_DCHPRI26(base) |  (value)))
#define DMA_CLR_DCHPRI26(base, value) (DMA_WR_DCHPRI26(base, DMA_RD_DCHPRI26(base) & ~(value)))
#define DMA_TOG_DCHPRI26(base, value) (DMA_WR_DCHPRI26(base, DMA_RD_DCHPRI26(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI26 bitfields
 */

/*!
 * @name Register DMA_DCHPRI26, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI26_CHPRI field. */
#define DMA_RD_DCHPRI26_CHPRI(base) ((DMA_DCHPRI26_REG(base) & DMA_DCHPRI26_CHPRI_MASK) >> DMA_DCHPRI26_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI26_CHPRI(base) (DMA_RD_DCHPRI26_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI26_CHPRI(base, value) (DMA_RMW_DCHPRI26(base, DMA_DCHPRI26_CHPRI_MASK, DMA_DCHPRI26_CHPRI(value)))
#define DMA_BWR_DCHPRI26_CHPRI(base, value) (DMA_WR_DCHPRI26_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI26, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI26_GRPPRI field. */
#define DMA_RD_DCHPRI26_GRPPRI(base) ((DMA_DCHPRI26_REG(base) & DMA_DCHPRI26_GRPPRI_MASK) >> DMA_DCHPRI26_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI26_GRPPRI(base) (DMA_RD_DCHPRI26_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI26, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI26_DPA field. */
#define DMA_RD_DCHPRI26_DPA(base) ((DMA_DCHPRI26_REG(base) & DMA_DCHPRI26_DPA_MASK) >> DMA_DCHPRI26_DPA_SHIFT)
#define DMA_BRD_DCHPRI26_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI26_REG(base), DMA_DCHPRI26_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI26_DPA(base, value) (DMA_RMW_DCHPRI26(base, DMA_DCHPRI26_DPA_MASK, DMA_DCHPRI26_DPA(value)))
#define DMA_BWR_DCHPRI26_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI26_REG(base), DMA_DCHPRI26_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI26, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI26_ECP field. */
#define DMA_RD_DCHPRI26_ECP(base) ((DMA_DCHPRI26_REG(base) & DMA_DCHPRI26_ECP_MASK) >> DMA_DCHPRI26_ECP_SHIFT)
#define DMA_BRD_DCHPRI26_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI26_REG(base), DMA_DCHPRI26_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI26_ECP(base, value) (DMA_RMW_DCHPRI26(base, DMA_DCHPRI26_ECP_MASK, DMA_DCHPRI26_ECP(value)))
#define DMA_BWR_DCHPRI26_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI26_REG(base), DMA_DCHPRI26_ECP_SHIFT) = (value))
/*@}*/

