RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the TRIG field to a new value. */
#define DMAMUX_WR_CHCFG_TRIG(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_TRIG_MASK, DMAMUX_CHCFG_TRIG(value)))
#define DMAMUX_BWR_CHCFG_TRIG(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_TRIG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFG, field ENBL[7] (RW)
 *
 * Enables the DMA channel.
 *
 * Values:
 * - 0b0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMAMux. The DMA has separate channel enables/disables, which
 *     should be used to disable or reconfigure a DMA channel.
 * - 0b1 - DMA channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFG_ENBL field. */
#define DMAMUX_RD_CHCFG_ENBL(base, index) ((DMAMUX_CHCFG_REG(base, index) & DMAMUX_CHCFG_ENBL_MASK) >> DMAMUX_CHCFG_ENBL_SHIFT)
#define DMAMUX_BRD_CHCFG_ENBL(base, index) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT))

/*! @brief Set the ENBL field to a new value. */
#define DMAMUX_WR_CHCFG_ENBL(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_ENBL_MASK, DMAMUX_CHCFG_ENBL(value)))
#define DMAMUX_BWR_CHCFG_ENBL(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT) = (value))
/*@}*/

/*
 * MK65F18 ENET
 *
 * Ethernet MAC-NET Core
 *
 * Registers defined in this header file:
 * - ENET_EIR - Interrupt Event Register
 * - ENET_EIMR - Interrupt Mask Register
 * - ENET_RDAR - Receive Descriptor Active Register
 * - ENET_TDAR - Transmit Descriptor Active Register
 * - ENET_ECR - Ethernet Control Register
 * - ENET_MMFR - MII Management Frame Register
 * - ENET_MSCR - MII Speed Control Register
 * - ENET_MIBC - MIB Control Register
 * - ENET_RCR - Receive Control Register
 * - ENET_TCR - Transmit Control Register
 * - ENET_PALR - Physical Address Lower Register
 * - ENET_PAUR - Physical Address Upper Register
 * - ENET_OPD - Opcode/Pause Duration Register
 * - ENET_IAUR - Descriptor Individual Upper Address Register
 * - ENET_IALR - Descriptor Individual Lower Address Register
 * - ENET_GAUR - Descriptor Group Upper Address Register
 * - ENET_GALR - Descriptor Group Lower Address Register
 * - ENET_TFWR - Transmit FIFO Watermark Register
 * - ENET_RDSR - Receive Descriptor Ring Start Register
 * - ENET_TDSR - Transmit Buffer Descriptor Ring Start Register
 * - ENET_MRBR - Maximum Receive Buffer Size Register
 * - ENET_RSFL - Receive FIFO Section Full Threshold
 * - ENET_RSEM - Receive FIFO Section Empty Threshold
 * - ENET_RAEM - Receive FIFO Almost Empty Threshold
 * - ENET_RAFL - Receive FIFO Almost Full Threshold
 * - ENET_TSEM - Transmit FIFO Section Empty Threshold
 * - ENET_TAEM - Transmit FIFO Almost Empty Threshold
 * - ENET_TAFL - Transmit FIFO Almost Full Threshold
 * - ENET_TIPG - Transmit Inter-Packet Gap
 * - ENET_FTRL - Frame Truncation Length
 * - ENET_TACC - Transmit Accelerator Function Configuration
 * - ENET_RACC - Receive Accelerator Function Configuration
 * - ENET_RMON_T_DROP - Reserved Statistic Register
 * - ENET_RMON_T_PACKETS - Tx Packet Count Statistic Register
 * - ENET_RMON_T_BC_PKT - Tx Broadcast Packets Statistic Register
 * - ENET_RMON_T_MC_PKT - Tx Multicast Packets Statistic Register
 * - ENET_RMON_T_CRC_ALIGN - Tx Packets with CRC/Align Error Statistic Register
 * - ENET_RMON_T_UNDERSIZE - Tx Packets Less Than Bytes and Good CRC Statistic Register
 * - ENET_RMON_T_OVERSIZE - Tx Packets GT MAX_FL bytes and Good CRC Statistic Register
 * - ENET_RMON_T_FRAG - Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register
 * - ENET_RMON_T_JAB - Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register
 * - ENET_RMON_T_COL - Tx Collision Count Statistic Register
 * - ENET_RMON_T_P64 - Tx 64-Byte Packets Statistic Register
 * - ENET_RMON_T_P65TO127 - Tx 65- to 127-byte Packets Statistic Register
 * - ENET_RMON_T_P128TO255 - Tx 128- to 255-byte Packets Statistic Register
 * - ENET_RMON_T_P256TO511 - Tx 256- to 511-byte Packets Statistic Register
 * - ENET_RMON_T_P512TO1023 - Tx 512- to 1023-byte Packets Statistic Register
 * - ENET_RMON_T_P1024TO2047 - Tx 1024- to 2047-byte Packets Statistic Register
 * - ENET_RMON_T_P_GTE2048 - Tx Packets Greater Than 2048 Bytes Statistic Register
 * - ENET_RMON_T_OCTETS - Tx Octets Statistic Register
 * - ENET_IEEE_T_DROP - IEEE_T_DROP Reserved Statistic Register
 * - ENET_IEEE_T_FRAME_OK - Frames Transmitted OK Statistic Register
 * - ENET_IEEE_T_1COL - Frames Transmitted with Single Collision Statistic Register
 * - ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions Statistic Register
 * - ENET_IEEE_T_DEF - Frames Transmitted after Deferral Delay Statistic Register
 * - ENET_IEEE_T_LCOL - Frames Transmitted with Late Collision Statistic Register
 * - ENET_IEEE_T_EXCOL - Frames Transmitted with Excessive Collisions Statistic Register
 * - ENET_IEEE_T_MACERR - Frames Transmitted with Tx FIFO Underrun Statistic Register
 * - ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error Statistic Register
 * - ENET_IEEE_T_SQE -
 * - ENET_IEEE_T_FDXFC - Flow Control Pause Frames Transmitted Statistic Register
 * - ENET_IEEE_T_OCTETS_OK - Octet Count for Frames Transmitted w/o Error Statistic Register
 * - ENET_RMON_R_PACKETS - Rx Packet Count Statistic Register
 * - ENET_RMON_R_BC_PKT - Rx Broadcast Packets Statistic Register
 * - ENET_RMON_R_MC_PKT - Rx Multicast Packets Statistic Register
 * - ENET_RMON_R_CRC_ALIGN - Rx Packets with CRC/Align Error Statistic Register
 * - ENET_RMON_R_UNDERSIZE - Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register
 * - ENET_RMON_R_OVERSIZE - Rx Packets Greater Than MAX_FL and Good CRC Statistic Register
 * - ENET_RMON_R_FRAG - Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register
 * - ENET_RMON_R_JAB - Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register
 * - ENET_RMON_R_RESVD_0 - Reserved Statistic Register
 * - ENET_RMON_R_P64 - Rx 64-Byte Packets Statistic Register
 * - ENET_RMON_R_P65TO127 - Rx 65- to 127-Byte Packets Statistic Register
 * - ENET_RMON_R_P128TO255 - Rx 128- to 255-Byte Packets Statistic Register
 * - ENET_RMON_R_P256TO511 - Rx 256- to 511-Byte Packets Statistic Register
 * - ENET_RMON_R_P512TO1023 - Rx 512- to 1023-Byte Packets Statistic Register
 * - ENET_RMON_R_P1024TO2047 - Rx 1024- to 2047-Byte Packets Statistic Register
 * - ENET_RMON_R_P_GTE2048 - Rx Packets Greater than 2048 Bytes Statistic Register
 * - ENET_RMON_R_OCTETS - Rx Octets Statistic Register
 * - ENET_IEEE_R_DROP - Frames not Counted Correctly Statistic Register
 * - ENET_IEEE_R_FRAME_OK - Frames Received OK Statistic Register
 * - ENET_IEEE_R_CRC - Frames Received with CRC Error Statistic Register
 * - ENET_IEEE_R_ALIGN - Frames Received with Alignment Error Statistic Register
 * - ENET_IEEE_R_MACERR - Receive FIFO Overflow Count Statistic Register
 * - ENET_IEEE_R_FDXFC - Flow Control Pause Frames Received Statistic Register
 * - ENET_IEEE_R_OCTETS_OK - Octet Count for Frames Received without Error Statistic Register
 * - ENET_ATCR - Adjustable Timer Control Register
 * - ENET_ATVR - Timer Value Register
 * - ENET_ATOFF - Timer Offset Register
 * - ENET_ATPER - Timer Period Register
 * - ENET_ATCOR - Timer Correction Register
 * - ENET_ATINC - Time-Stamping Clock Period Register
 * - ENET_ATSTMP - Timestamp of Last Transmitted Frame
 * - ENET_TGSR - Timer Global Status Register
 * - ENET_TCSR - Timer Control Status Register
 * - ENET_TCCR - Timer Compare Capture Register
 */

#define ENET_INSTANCE_COUNT (1U) /*!< Number of instances of the ENET module. */
#define ENET_IDX (0U) /*!< Instance number for ENET. */

