RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * ENET_IALR - Descriptor Individual Lower Address Register
 ******************************************************************************/

/*!
 * @brief ENET_IALR - Descriptor Individual Lower Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * IALR contains the lower 32 bits of the 64-bit individual address hash table.
 * The address recognition process uses this table to check for a possible match
 * with the DA field of receive frames with an individual DA. This register is
 * not reset and you must initialize it.
 */
/*!
 * @name Constants and macros for entire ENET_IALR register
 */
/*@{*/
#define ENET_RD_IALR(base)       (ENET_IALR_REG(base))
#define ENET_WR_IALR(base, value) (ENET_IALR_REG(base) = (value))
#define ENET_RMW_IALR(base, mask, value) (ENET_WR_IALR(base, (ENET_RD_IALR(base) & ~(mask)) | (value)))
#define ENET_SET_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) |  (value)))
#define ENET_CLR_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) & ~(value)))
#define ENET_TOG_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_GAUR - Descriptor Group Upper Address Register
 ******************************************************************************/

/*!
 * @brief ENET_GAUR - Descriptor Group Upper Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * GAUR contains the upper 32 bits of the 64-bit hash table used in the address
 * recognition process for receive frames with a multicast address. You must
 * initialize this register.
 */
/*!
 * @name Constants and macros for entire ENET_GAUR register
 */
/*@{*/
#define ENET_RD_GAUR(base)       (ENET_GAUR_REG(base))
#define ENET_WR_GAUR(base, value) (ENET_GAUR_REG(base) = (value))
#define ENET_RMW_GAUR(base, mask, value) (ENET_WR_GAUR(base, (ENET_RD_GAUR(base) & ~(mask)) | (value)))
#define ENET_SET_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) |  (value)))
#define ENET_CLR_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) & ~(value)))
#define ENET_TOG_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_GALR - Descriptor Group Lower Address Register
 ******************************************************************************/

/*!
 * @brief ENET_GALR - Descriptor Group Lower Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * GALR contains the lower 32 bits of the 64-bit hash table used in the address
 * recognition process for receive frames with a multicast address. You must
 * initialize this register.
 */
/*!
 * @name Constants and macros for entire ENET_GALR register
 */
/*@{*/
#define ENET_RD_GALR(base)       (ENET_GALR_REG(base))
#define ENET_WR_GALR(base, value) (ENET_GALR_REG(base) = (value))
#define ENET_RMW_GALR(base, mask, value) (ENET_WR_GALR(base, (ENET_RD_GALR(base) & ~(mask)) | (value)))
#define ENET_SET_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) |  (value)))
#define ENET_CLR_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) & ~(value)))
#define ENET_TOG_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_TFWR - Transmit FIFO Watermark Register
 ******************************************************************************/

/*!
 * @brief ENET_TFWR - Transmit FIFO Watermark Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * If TFWR[STRFWD] is cleared, TFWR[TFWR] controls the amount of data required
 * in the transmit FIFO before transmission of a frame can begin. This allows you
 * to minimize transmit latency (TFWR = 00 or 01) or allow for larger bus access
 * latency (TFWR = 11) due to contention for the system bus. Setting the
 * watermark to a high value minimizes the risk of transmit FIFO underrun due to
 * contention for the system bus. The byte counts associated with the TFWR field may need
 * to be modified to match a given system requirement, for example, worst-case
 * bus access latency by the transmit data uDMA channel. When the FIFO level
 * reaches the value the TFWR field and when the STR_FWD is set to '0', the MAC
 * transmit control logic starts frame transmission even before the end-of-frame is
 * available in the FIFO (cut-through operation). If a complete frame has a size
 * smaller than the threshold programmed with TFWR, the MAC also transmits the Frame
 * to the line. To enable store and forward on the Transmit path, set STR_FWD to
 * '1'. In this case, the MAC starts to transmit data only when a complete frame
 * is stored in the Transmit FIFO.
 */
/*!
 * @name Constants and macros for entire ENET_TFWR register
 */
/*@{*/
#define ENET_RD_TFWR(base)       (ENET_TFWR_REG(base))
#define ENET_WR_TFWR(base, value) (ENET_TFWR_REG(base) = (value))
#define ENET_RMW_TFWR(base, mask, value) (ENET_WR_TFWR(base, (ENET_RD_TFWR(base) & ~(mask)) | (value)))
#define ENET_SET_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) |  (value)))
#define ENET_CLR_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) & ~(value)))
#define ENET_TOG_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TFWR bitfields
 */

/*!
 * @name Register ENET_TFWR, field TFWR[5:0] (RW)
 *
 * If TFWR[STRFWD] is cleared, this field indicates the number of bytes, in
 * steps of 64 bytes, written to the transmit FIFO before transmission of a frame
 * begins. If a frame with less than the threshold is written, it is still sent
 * independently of this threshold setting. The threshold is relevant only if the
 * frame is larger than the threshold given.
 *
 * Values:
 * - 0b000000 - 64 bytes written.
 * - 0b000001 - 64 bytes written.
 * - 0b000010 - 128 bytes written.
 * - 0b000011 - 192 bytes written.
 * - 0b011111 - 1984 bytes written.
 */
/*@{*/
/*! @brief Read current value of the ENET_TFWR_TFWR field. */
#define ENET_RD_TFWR_TFWR(base) ((ENET_TFWR_REG(base) & ENET_TFWR_TFWR_MASK) >> ENET_TFWR_TFWR_SHIFT)
#define ENET_BRD_TFWR_TFWR(base) (ENET_RD_TFWR_TFWR(base))

/*! @brief Set the TFWR field to a new value. */
#define ENET_WR_TFWR_TFWR(base, value) (ENET_RMW_TFWR(base, ENET_TFWR_TFWR_MASK, ENET_TFWR_TFWR(value)))
#define ENET_BWR_TFWR_TFWR(base, value) (ENET_WR_TFWR_TFWR(base, value))
/*@}*/

/*!
 * @name Register ENET_TFWR, field STRFWD[8] (RW)
 *
 * Values:
 * - 0b0 - Reset. The transmission start threshold is programmed in TFWR[TFWR].
 * - 0b1 - Enabled.
 */
/*@{*/
/*! @brief Read current value of the ENET_TFWR_STRFWD field. */
#define ENET_RD_TFWR_STRFWD(base) ((ENET_TFWR_REG(base) & ENET_TFWR_STRFWD_MASK) >> ENET_TFWR_STRFWD_SHIFT)
#define ENET_BRD_TFWR_STRFWD(base) (BITBAND_ACCESS32(&ENET_TFWR_REG(base), ENET_TFWR_STRFWD_SHIFT))

/*! @brief Set the STRFWD field to a new value. */
#define ENET_WR_TFWR_STRFWD(base, value) (ENET_RMW_TFWR(base, ENET_TFWR_STRFWD_MASK, ENET_TFWR_STRFWD(value)))
#define ENET_BWR_TFWR_STRFWD(base, value) (BITBAND_ACCESS32(&ENET_TFWR_REG(base), ENET_TFWR_STRFWD_SHIFT) = (value))
/*@}*/

