RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the OFFRST field to a new value. */
#define ENET_WR_ATCR_OFFRST(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_OFFRST_MASK, ENET_ATCR_OFFRST(value)))
#define ENET_BWR_ATCR_OFFRST(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_OFFRST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PEREN[4] (RW)
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - A period event interrupt can be generated (EIR[TS_TIMER]) and the
 *     event signal output is asserted when the timer wraps around according to the
 *     periodic setting ATPER. The timer period value must be set before setting
 *     this bit. Not all devices contain the event signal output. See the chip
 *     configuration details.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PEREN field. */
#define ENET_RD_ATCR_PEREN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PEREN_MASK) >> ENET_ATCR_PEREN_SHIFT)
#define ENET_BRD_ATCR_PEREN(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PEREN_SHIFT))

/*! @brief Set the PEREN field to a new value. */
#define ENET_WR_ATCR_PEREN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PEREN_MASK, ENET_ATCR_PEREN(value)))
#define ENET_BWR_ATCR_PEREN(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PEREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PINPER[7] (RW)
 *
 * Enables event signal output assertion on period event. Not all devices
 * contain the event signal output. See the chip configuration details.
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PINPER field. */
#define ENET_RD_ATCR_PINPER(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PINPER_MASK) >> ENET_ATCR_PINPER_SHIFT)
#define ENET_BRD_ATCR_PINPER(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PINPER_SHIFT))

/*! @brief Set the PINPER field to a new value. */
#define ENET_WR_ATCR_PINPER(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PINPER_MASK, ENET_ATCR_PINPER(value)))
#define ENET_BWR_ATCR_PINPER(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PINPER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field RESTART[9] (RW)
 *
 * Resets the timer to zero. This has no effect on the counter enable. If the
 * counter is enabled when this field is set, the timer is reset to zero and starts
 * counting from there. When set, all other fields are ignored during a write.
 * This field automatically clears to 0 after the command completes. The Reset
 * Timer command requires at least 6 clock cycles of either the register clock or
 * the 1588/timestamp clock, whichever is greater, to complete.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_RESTART field. */
#define ENET_RD_ATCR_RESTART(base) ((ENET_ATCR_REG(base) & ENET_ATCR_RESTART_MASK) >> ENET_ATCR_RESTART_SHIFT)
#define ENET_BRD_ATCR_RESTART(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_RESTART_SHIFT))

/*! @brief Set the RESTART field to a new value. */
#define ENET_WR_ATCR_RESTART(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_RESTART_MASK, ENET_ATCR_RESTART(value)))
#define ENET_BWR_ATCR_RESTART(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_RESTART_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field CAPTURE[11] (RW)
 *
 * This field automatically clears to 0 after the command completes. To ensure
 * that the correct time value is read from the ATVR register, a minimum amount of
 * time must elapse from issuing this command to reading the ATVR register. This
 * minimum time is defined by the greater of either six register clock cycles or
 * six 1588/timestamp clock cycles.
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - The current time is captured and can be read from the ATVR register.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_CAPTURE field. */
#define ENET_RD_ATCR_CAPTURE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_CAPTURE_MASK) >> ENET_ATCR_CAPTURE_SHIFT)
#define ENET_BRD_ATCR_CAPTURE(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_CAPTURE_SHIFT))

/*! @brief Set the CAPTURE field to a new value. */
#define ENET_WR_ATCR_CAPTURE(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_CAPTURE_MASK, ENET_ATCR_CAPTURE(value)))
#define ENET_BWR_ATCR_CAPTURE(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_CAPTURE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field SLAVE[13] (RW)
 *
 * Values:
 * - 0b0 - The timer is active and all configuration fields in this register are
 *     relevant.
 * - 0b1 - The internal timer is disabled and the externally provided timer
 *     value is used. All other fields, except CAPTURE, in this register have no
 *     effect. CAPTURE can still be used to capture the current timer value.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_SLAVE field. */
#define ENET_RD_ATCR_SLAVE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_SLAVE_MASK) >> ENET_ATCR_SLAVE_SHIFT)
#define ENET_BRD_ATCR_SLAVE(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_SLAVE_SHIFT))

/*! @brief Set the SLAVE field to a new value. */
#define ENET_WR_ATCR_SLAVE(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_SLAVE_MASK, ENET_ATCR_SLAVE(value)))
#define ENET_BWR_ATCR_SLAVE(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_SLAVE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_ATVR - Timer Value Register
 ******************************************************************************/

/*!
 * @brief ENET_ATVR - Timer Value Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATVR register
 */
/*@{*/
#define ENET_RD_ATVR(base)       (ENET_ATVR_REG(base))
#define ENET_WR_ATVR(base, value) (ENET_ATVR_REG(base) = (value))
#define ENET_RMW_ATVR(base, mask, value) (ENET_WR_ATVR(base, (ENET_RD_ATVR(base) & ~(mask)) | (value)))
#define ENET_SET_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) |  (value)))
#define ENET_CLR_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) & ~(value)))
#define ENET_TOG_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) ^  (value)))
/*@}*/

