RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * ENET_ATSTMP - Timestamp of Last Transmitted Frame
 ******************************************************************************/

/*!
 * @brief ENET_ATSTMP - Timestamp of Last Transmitted Frame (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATSTMP register
 */
/*@{*/
#define ENET_RD_ATSTMP(base)     (ENET_ATSTMP_REG(base))
/*@}*/

/*******************************************************************************
 * ENET_TGSR - Timer Global Status Register
 ******************************************************************************/

/*!
 * @brief ENET_TGSR - Timer Global Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_TGSR register
 */
/*@{*/
#define ENET_RD_TGSR(base)       (ENET_TGSR_REG(base))
#define ENET_WR_TGSR(base, value) (ENET_TGSR_REG(base) = (value))
#define ENET_RMW_TGSR(base, mask, value) (ENET_WR_TGSR(base, (ENET_RD_TGSR(base) & ~(mask)) | (value)))
#define ENET_SET_TGSR(base, value) (ENET_WR_TGSR(base, ENET_RD_TGSR(base) |  (value)))
#define ENET_CLR_TGSR(base, value) (ENET_WR_TGSR(base, ENET_RD_TGSR(base) & ~(value)))
#define ENET_TOG_TGSR(base, value) (ENET_WR_TGSR(base, ENET_RD_TGSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TGSR bitfields
 */

/*!
 * @name Register ENET_TGSR, field TF0[0] (W1C)
 *
 * Values:
 * - 0b0 - Timer Flag for Channel 0 is clear
 * - 0b1 - Timer Flag for Channel 0 is set
 */
/*@{*/
/*! @brief Read current value of the ENET_TGSR_TF0 field. */
#define ENET_RD_TGSR_TF0(base) ((ENET_TGSR_REG(base) & ENET_TGSR_TF0_MASK) >> ENET_TGSR_TF0_SHIFT)
#define ENET_BRD_TGSR_TF0(base) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF0_SHIFT))

/*! @brief Set the TF0 field to a new value. */
#define ENET_WR_TGSR_TF0(base, value) (ENET_RMW_TGSR(base, (ENET_TGSR_TF0_MASK | ENET_TGSR_TF1_MASK | ENET_TGSR_TF2_MASK | ENET_TGSR_TF3_MASK), ENET_TGSR_TF0(value)))
#define ENET_BWR_TGSR_TF0(base, value) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TGSR, field TF1[1] (W1C)
 *
 * Values:
 * - 0b0 - Timer Flag for Channel 1 is clear
 * - 0b1 - Timer Flag for Channel 1 is set
 */
/*@{*/
/*! @brief Read current value of the ENET_TGSR_TF1 field. */
#define ENET_RD_TGSR_TF1(base) ((ENET_TGSR_REG(base) & ENET_TGSR_TF1_MASK) >> ENET_TGSR_TF1_SHIFT)
#define ENET_BRD_TGSR_TF1(base) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF1_SHIFT))

/*! @brief Set the TF1 field to a new value. */
#define ENET_WR_TGSR_TF1(base, value) (ENET_RMW_TGSR(base, (ENET_TGSR_TF1_MASK | ENET_TGSR_TF0_MASK | ENET_TGSR_TF2_MASK | ENET_TGSR_TF3_MASK), ENET_TGSR_TF1(value)))
#define ENET_BWR_TGSR_TF1(base, value) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TGSR, field TF2[2] (W1C)
 *
 * Values:
 * - 0b0 - Timer Flag for Channel 2 is clear
 * - 0b1 - Timer Flag for Channel 2 is set
 */
/*@{*/
/*! @brief Read current value of the ENET_TGSR_TF2 field. */
#define ENET_RD_TGSR_TF2(base) ((ENET_TGSR_REG(base) & ENET_TGSR_TF2_MASK) >> ENET_TGSR_TF2_SHIFT)
#define ENET_BRD_TGSR_TF2(base) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF2_SHIFT))

/*! @brief Set the TF2 field to a new value. */
#define ENET_WR_TGSR_TF2(base, value) (ENET_RMW_TGSR(base, (ENET_TGSR_TF2_MASK | ENET_TGSR_TF0_MASK | ENET_TGSR_TF1_MASK | ENET_TGSR_TF3_MASK), ENET_TGSR_TF2(value)))
#define ENET_BWR_TGSR_TF2(base, value) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TGSR, field TF3[3] (W1C)
 *
 * Values:
 * - 0b0 - Timer Flag for Channel 3 is clear
 * - 0b1 - Timer Flag for Channel 3 is set
 */
/*@{*/
/*! @brief Read current value of the ENET_TGSR_TF3 field. */
#define ENET_RD_TGSR_TF3(base) ((ENET_TGSR_REG(base) & ENET_TGSR_TF3_MASK) >> ENET_TGSR_TF3_SHIFT)
#define ENET_BRD_TGSR_TF3(base) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF3_SHIFT))

/*! @brief Set the TF3 field to a new value. */
#define ENET_WR_TGSR_TF3(base, value) (ENET_RMW_TGSR(base, (ENET_TGSR_TF3_MASK | ENET_TGSR_TF0_MASK | ENET_TGSR_TF1_MASK | ENET_TGSR_TF2_MASK), ENET_TGSR_TF3(value)))
#define ENET_BWR_TGSR_TF3(base, value) (BITBAND_ACCESS32(&ENET_TGSR_REG(base), ENET_TGSR_TF3_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_TCSR - Timer Control Status Register
 ******************************************************************************/

/*!
 * @brief ENET_TCSR - Timer Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_TCSR register
 */
/*@{*/
#define ENET_RD_TCSR(base, index) (ENET_TCSR_REG(base, index))
#define ENET_WR_TCSR(base, index, value) (ENET_TCSR_REG(base, index) = (value))
#define ENET_RMW_TCSR(base, index, mask, value) (ENET_WR_TCSR(base, index, (ENET_RD_TCSR(base, index) & ~(mask)) | (value)))
#define ENET_SET_TCSR(base, index, value) (ENET_WR_TCSR(base, index, ENET_RD_TCSR(base, index) |  (value)))
#define ENET_CLR_TCSR(base, index, value) (ENET_WR_TCSR(base, index, ENET_RD_TCSR(base, index) & ~(value)))
#define ENET_TOG_TCSR(base, index, value) (ENET_WR_TCSR(base, index, ENET_RD_TCSR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TCSR bitfields
 */

/*!
 * @name Register ENET_TCSR, field TDRE[0] (RW)
 *
 * Values:
 * - 0b0 - DMA request is disabled
 * - 0b1 - DMA request is enabled
 */
/*@{*/
/*! @brief Read current value of the ENET_TCSR_TDRE field. */
#define ENET_RD_TCSR_TDRE(base, index) ((ENET_TCSR_REG(base, index) & ENET_TCSR_TDRE_MASK) >> ENET_TCSR_TDRE_SHIFT)
#define ENET_BRD_TCSR_TDRE(base, index) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TDRE_SHIFT))

/*! @brief Set the TDRE field to a new value. */
#define ENET_WR_TCSR_TDRE(base, index, value) (ENET_RMW_TCSR(base, index, (ENET_TCSR_TDRE_MASK | ENET_TCSR_TF_MASK), ENET_TCSR_TDRE(value)))
#define ENET_BWR_TCSR_TDRE(base, index, value) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TDRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TCSR, field TMODE[5:2] (RW)
 *
 * Updating the Timer Mode field takes a few cycles to register because it is
 * synchronized to the 1588 clock. The version of Timer Mode returned on a read is
 * from the 1588 clock domain. When changing Timer Mode, always disable the
 * channel and read this register to verify the channel is disabled first.
 *
 * Values:
 * - 0b0000 - Timer Channel is disabled.
 * - 0b0001 - Timer Channel is configured for Input Capture on rising edge.
 * - 0b0010 - Timer Channel is configured for Input Capture on falling edge.
 * - 0b0011 - Timer Channel is configured for Input Capture on both edges.
 * - 0b0100 - Timer Channel is configured for Output Compare - software only.
 * - 0b0101 - Timer Channel is configured for Output Compare - toggle output on
 *     compare.
 * - 0b0110 - Timer Channel is configured for Output Compare - clear output on
 *     compare.
 * - 0b0111 - Timer Channel is configured for Output Compare - set output on
 *     compare.
 * - 0b1000 - Reserved
 * - 0b1010 - Timer Channel is configured for Output Compare - clear output on
 *     compare, set output on overflow.
 * - 0b1110 - Timer Channel is configured for Output Compare - pulse output low
 *     on compare for one 1588-clock cycle.
 * - 0b1111 - Timer Channel is configured for Output Compare - pulse output high
 *     on compare for one 1588-clock cycle.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCSR_TMODE field. */
#define ENET_RD_TCSR_TMODE(base, index) ((ENET_TCSR_REG(base, index) & ENET_TCSR_TMODE_MASK) >> ENET_TCSR_TMODE_SHIFT)
#define ENET_BRD_TCSR_TMODE(base, index) (ENET_RD_TCSR_TMODE(base, index))

/*! @brief Set the TMODE field to a new value. */
#define ENET_WR_TCSR_TMODE(base, index, value) (ENET_RMW_TCSR(base, index, (ENET_TCSR_TMODE_MASK | ENET_TCSR_TF_MASK), ENET_TCSR_TMODE(value)))
#define ENET_BWR_TCSR_TMODE(base, index, value) (ENET_WR_TCSR_TMODE(base, index, value))
/*@}*/

/*!
 * @name Register ENET_TCSR, field TIE[6] (RW)
 *
 * Values:
 * - 0b0 - Interrupt is disabled
 * - 0b1 - Interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENET_TCSR_TIE field. */
#define ENET_RD_TCSR_TIE(base, index) ((ENET_TCSR_REG(base, index) & ENET_TCSR_TIE_MASK) >> ENET_TCSR_TIE_SHIFT)
#define ENET_BRD_TCSR_TIE(base, index) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TIE_SHIFT))

/*! @brief Set the TIE field to a new value. */
#define ENET_WR_TCSR_TIE(base, index, value) (ENET_RMW_TCSR(base, index, (ENET_TCSR_TIE_MASK | ENET_TCSR_TF_MASK), ENET_TCSR_TIE(value)))
#define ENET_BWR_TCSR_TIE(base, index, value) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TCSR, field TF[7] (W1C)
 *
 * Sets when input capture or output compare occurs. This flag is double
 * buffered between the module clock and 1588 clock domains. When this field is 1, it
 * can be cleared to 0 by writing 1 to it.
 *
 * Values:
 * - 0b0 - Input Capture or Output Compare has not occurred.
 * - 0b1 - Input Capture or Output Compare has occurred.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCSR_TF field. */
#define ENET_RD_TCSR_TF(base, index) ((ENET_TCSR_REG(base, index) & ENET_TCSR_TF_MASK) >> ENET_TCSR_TF_SHIFT)
#define ENET_BRD_TCSR_TF(base, index) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TF_SHIFT))

/*! @brief Set the TF field to a new value. */
#define ENET_WR_TCSR_TF(base, index, value) (ENET_RMW_TCSR(base, index, ENET_TCSR_TF_MASK, ENET_TCSR_TF(value)))
#define ENET_BWR_TCSR_TF(base, index, value) (BITBAND_ACCESS32(&ENET_TCSR_REG(base, index), ENET_TCSR_TF_SHIFT) = (value))
/*@}*/

