RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * FMC_DATA_ML - Cache Data Storage (mid-lower word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_ML - Cache Data Storage (mid-lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-lower word (bits [63:32]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_ML register
 */
/*@{*/
#define FMC_RD_DATA_ML(base, index, index2) (FMC_DATA_ML_REG(base, index, index2))
#define FMC_WR_DATA_ML(base, index, index2, value) (FMC_DATA_ML_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_ML(base, index, index2, mask, value) (FMC_WR_DATA_ML(base, index, index2, (FMC_RD_DATA_ML(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) |  (value)))
#define FMC_CLR_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATA_LM - Cache Data Storage (lowermost word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_LM - Cache Data Storage (lowermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * lowermost word (bits [31:0]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_LM register
 */
/*@{*/
#define FMC_RD_DATA_LM(base, index, index2) (FMC_DATA_LM_REG(base, index, index2))
#define FMC_WR_DATA_LM(base, index, index2, value) (FMC_DATA_LM_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_LM(base, index, index2, mask, value) (FMC_WR_DATA_LM(base, index, index2, (FMC_RD_DATA_LM(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) |  (value)))
#define FMC_CLR_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) ^  (value)))
/*@}*/

/*
 * MK65F18 FTFE
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - FTFE_FSTAT - Flash Status Register
 * - FTFE_FCNFG - Flash Configuration Register
 * - FTFE_FSEC - Flash Security Register
 * - FTFE_FOPT - Flash Option Register
 * - FTFE_FCCOB3 - Flash Common Command Object Registers
 * - FTFE_FCCOB2 - Flash Common Command Object Registers
 * - FTFE_FCCOB1 - Flash Common Command Object Registers
 * - FTFE_FCCOB0 - Flash Common Command Object Registers
 * - FTFE_FCCOB7 - Flash Common Command Object Registers
 * - FTFE_FCCOB6 - Flash Common Command Object Registers
 * - FTFE_FCCOB5 - Flash Common Command Object Registers
 * - FTFE_FCCOB4 - Flash Common Command Object Registers
 * - FTFE_FCCOBB - Flash Common Command Object Registers
 * - FTFE_FCCOBA - Flash Common Command Object Registers
 * - FTFE_FCCOB9 - Flash Common Command Object Registers
 * - FTFE_FCCOB8 - Flash Common Command Object Registers
 * - FTFE_FPROT3 - Program Flash Protection Registers
 * - FTFE_FPROT2 - Program Flash Protection Registers
 * - FTFE_FPROT1 - Program Flash Protection Registers
 * - FTFE_FPROT0 - Program Flash Protection Registers
 * - FTFE_FEPROT - EEPROM Protection Register
 * - FTFE_FDPROT - Data Flash Protection Register
 * - FTFE_XACCH3 - Execute-only Access Registers
 * - FTFE_XACCH2 - Execute-only Access Registers
 * - FTFE_XACCH1 - Execute-only Access Registers
 * - FTFE_XACCH0 - Execute-only Access Registers
 * - FTFE_XACCL3 - Execute-only Access Registers
 * - FTFE_XACCL2 - Execute-only Access Registers
 * - FTFE_XACCL1 - Execute-only Access Registers
 * - FTFE_XACCL0 - Execute-only Access Registers
 * - FTFE_SACCH3 - Supervisor-only Access Registers
 * - FTFE_SACCH2 - Supervisor-only Access Registers
 * - FTFE_SACCH1 - Supervisor-only Access Registers
 * - FTFE_SACCH0 - Supervisor-only Access Registers
 * - FTFE_SACCL3 - Supervisor-only Access Registers
 * - FTFE_SACCL2 - Supervisor-only Access Registers
 * - FTFE_SACCL1 - Supervisor-only Access Registers
 * - FTFE_SACCL0 - Supervisor-only Access Registers
 * - FTFE_FACSS - Flash Access Segment Size Register
 * - FTFE_FACSN - Flash Access Segment Number Register
 */

#define FTFE_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFE module. */
#define FTFE_IDX (0U) /*!< Instance number for FTFE. */

/*******************************************************************************
 * FTFE_FSTAT - Flash Status Register
 ******************************************************************************/

/*!
 * @brief FTFE_FSTAT - Flash Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FSTAT register reports the operational status of the FTFE module. The
 * CCIF, RDCOLERR, ACCERR, and FPVIOL bits are readable and writable. The MGSTAT0
 * bit is read only. The unassigned bits read 0 and are not writable. When set, the
 * Access Error (ACCERR) and Flash Protection Violation (FPVIOL) bits in this
 * register prevent the launch of any more commands or writes to the FlexRAM (when
 * EEERDY is set) until the flag is cleared (by writing a one to it).
 */
/*!
 * @name Constants and macros for entire FTFE_FSTAT register
 */
/*@{*/
#define FTFE_RD_FSTAT(base)      (FTFE_FSTAT_REG(base))
#define FTFE_WR_FSTAT(base, value) (FTFE_FSTAT_REG(base) = (value))
#define FTFE_RMW_FSTAT(base, mask, value) (FTFE_WR_FSTAT(base, (FTFE_RD_FSTAT(base) & ~(mask)) | (value)))
#define FTFE_SET_FSTAT(base, value) (FTFE_WR_FSTAT(base, FTFE_RD_FSTAT(base) |  (value)))
#define FTFE_CLR_FSTAT(base, value) (FTFE_WR_FSTAT(base, FTFE_RD_FSTAT(base) & ~(value)))
#define FTFE_TOG_FSTAT(base, value) (FTFE_WR_FSTAT(base, FTFE_RD_FSTAT(base) ^  (value)))
/*@}*/

