RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * FTFE_XACCH1 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCH1 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCH1 register
 */
/*@{*/
#define FTFE_RD_XACCH1(base)     (FTFE_XACCH1_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_XACCH0 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCH0 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCH0 register
 */
/*@{*/
#define FTFE_RD_XACCH0(base)     (FTFE_XACCH0_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_XACCL3 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCL3 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCL3 register
 */
/*@{*/
#define FTFE_RD_XACCL3(base)     (FTFE_XACCL3_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_XACCL2 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCL2 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCL2 register
 */
/*@{*/
#define FTFE_RD_XACCL2(base)     (FTFE_XACCL2_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_XACCL1 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCL1 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCL1 register
 */
/*@{*/
#define FTFE_RD_XACCL1(base)     (FTFE_XACCL1_REG(base))
/*@}*/

