RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * FTFE_SACCL3 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCL3 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCL3 register
 */
/*@{*/
#define FTFE_RD_SACCL3(base)     (FTFE_SACCL3_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCL2 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCL2 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCL2 register
 */
/*@{*/
#define FTFE_RD_SACCL2(base)     (FTFE_SACCL2_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCL1 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCL1 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCL1 register
 */
/*@{*/
#define FTFE_RD_SACCL1(base)     (FTFE_SACCL1_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCL0 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCL0 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCL0 register
 */
/*@{*/
#define FTFE_RD_SACCL0(base)     (FTFE_SACCL0_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_FACSS - Flash Access Segment Size Register
 ******************************************************************************/

/*!
 * @brief FTFE_FACSS - Flash Access Segment Size Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash access segment size register determines which bits in the address
 * are used to index into the SACC and XACC bitmaps to get the appropriate
 * permission flags. All bits in the register are read-only. The contents of this
 * register are loaded during the reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_FACSS register
 */
/*@{*/
#define FTFE_RD_FACSS(base)      (FTFE_FACSS_REG(base))
/*@}*/

