RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the FILTE field to a new value. */
#define LLWU_WR_FILT2_FILTE(base, value) (LLWU_RMW_FILT2(base, (LLWU_FILT2_FILTE_MASK | LLWU_FILT2_FILTF_MASK), LLWU_FILT2_FILTE(value)))
#define LLWU_BWR_FILT2_FILTE(base, value) (LLWU_WR_FILT2_FILTE(base, value))
/*@}*/

/*!
 * @name Register LLWU_FILT2, field FILTF[7] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 2 was not a wakeup source
 * - 0b1 - Pin Filter 2 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT2_FILTF field. */
#define LLWU_RD_FILT2_FILTF(base) ((LLWU_FILT2_REG(base) & LLWU_FILT2_FILTF_MASK) >> LLWU_FILT2_FILTF_SHIFT)
#define LLWU_BRD_FILT2_FILTF(base) (BITBAND_ACCESS8(&LLWU_FILT2_REG(base), LLWU_FILT2_FILTF_SHIFT))

/*! @brief Set the FILTF field to a new value. */
#define LLWU_WR_FILT2_FILTF(base, value) (LLWU_RMW_FILT2(base, LLWU_FILT2_FILTF_MASK, LLWU_FILT2_FILTF(value)))
#define LLWU_BWR_FILT2_FILTF(base, value) (BITBAND_ACCESS8(&LLWU_FILT2_REG(base), LLWU_FILT2_FILTF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LLWU_FILT3 - LLWU Pin Filter 3 register
 ******************************************************************************/

/*!
 * @brief LLWU_FILT3 - LLWU Pin Filter 3 register (RW)
 *
 * Reset value: 0x00U
 *
 * LLWU_FILT3 is a control and status register that is used to enable/disable
 * the digital filter 3 features for an external pin. This register is reset on
 * Chip Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control
 * Module (RCM). The RCM implements many of the reset functions for the chip. See
 * the chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_FILT3 register
 */
/*@{*/
#define LLWU_RD_FILT3(base)      (LLWU_FILT3_REG(base))
#define LLWU_WR_FILT3(base, value) (LLWU_FILT3_REG(base) = (value))
#define LLWU_RMW_FILT3(base, mask, value) (LLWU_WR_FILT3(base, (LLWU_RD_FILT3(base) & ~(mask)) | (value)))
#define LLWU_SET_FILT3(base, value) (LLWU_WR_FILT3(base, LLWU_RD_FILT3(base) |  (value)))
#define LLWU_CLR_FILT3(base, value) (LLWU_WR_FILT3(base, LLWU_RD_FILT3(base) & ~(value)))
#define LLWU_TOG_FILT3(base, value) (LLWU_WR_FILT3(base, LLWU_RD_FILT3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_FILT3 bitfields
 */

/*!
 * @name Register LLWU_FILT3, field FILTSEL[4:0] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into the filter.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT3_FILTSEL field. */
#define LLWU_RD_FILT3_FILTSEL(base) ((LLWU_FILT3_REG(base) & LLWU_FILT3_FILTSEL_MASK) >> LLWU_FILT3_FILTSEL_SHIFT)
#define LLWU_BRD_FILT3_FILTSEL(base) (LLWU_RD_FILT3_FILTSEL(base))

/*! @brief Set the FILTSEL field to a new value. */
#define LLWU_WR_FILT3_FILTSEL(base, value) (LLWU_RMW_FILT3(base, (LLWU_FILT3_FILTSEL_MASK | LLWU_FILT3_FILTF_MASK), LLWU_FILT3_FILTSEL(value)))
#define LLWU_BWR_FILT3_FILTSEL(base, value) (LLWU_WR_FILT3_FILTSEL(base, value))
/*@}*/

/*!
 * @name Register LLWU_FILT3, field FILTE[6:5] (RW)
 *
 * Controls the digital filter options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT3_FILTE field. */
#define LLWU_RD_FILT3_FILTE(base) ((LLWU_FILT3_REG(base) & LLWU_FILT3_FILTE_MASK) >> LLWU_FILT3_FILTE_SHIFT)
#define LLWU_BRD_FILT3_FILTE(base) (LLWU_RD_FILT3_FILTE(base))

/*! @brief Set the FILTE field to a new value. */
#define LLWU_WR_FILT3_FILTE(base, value) (LLWU_RMW_FILT3(base, (LLWU_FILT3_FILTE_MASK | LLWU_FILT3_FILTF_MASK), LLWU_FILT3_FILTE(value)))
#define LLWU_BWR_FILT3_FILTE(base, value) (LLWU_WR_FILT3_FILTE(base, value))
/*@}*/

/*!
 * @name Register LLWU_FILT3, field FILTF[7] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 3 was not a wakeup source
 * - 0b1 - Pin Filter 3 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT3_FILTF field. */
#define LLWU_RD_FILT3_FILTF(base) ((LLWU_FILT3_REG(base) & LLWU_FILT3_FILTF_MASK) >> LLWU_FILT3_FILTF_SHIFT)
#define LLWU_BRD_FILT3_FILTF(base) (BITBAND_ACCESS8(&LLWU_FILT3_REG(base), LLWU_FILT3_FILTF_SHIFT))

/*! @brief Set the FILTF field to a new value. */
#define LLWU_WR_FILT3_FILTF(base, value) (LLWU_RMW_FILT3(base, LLWU_FILT3_FILTF_MASK, LLWU_FILT3_FILTF(value)))
#define LLWU_BWR_FILT3_FILTF(base, value) (BITBAND_ACCESS8(&LLWU_FILT3_REG(base), LLWU_FILT3_FILTF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LLWU_FILT4 - LLWU Pin Filter 4 register
 ******************************************************************************/

/*!
 * @brief LLWU_FILT4 - LLWU Pin Filter 4 register (RW)
 *
 * Reset value: 0x00U
 *
 * LLWU_FILT4 is a control and status register that is used to enable/disable
 * the digital filter 4 features for an external pin. This register is reset on
 * Chip Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control
 * Module (RCM). The RCM implements many of the reset functions for the chip. See
 * the chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_FILT4 register
 */
/*@{*/
#define LLWU_RD_FILT4(base)      (LLWU_FILT4_REG(base))
#define LLWU_WR_FILT4(base, value) (LLWU_FILT4_REG(base) = (value))
#define LLWU_RMW_FILT4(base, mask, value) (LLWU_WR_FILT4(base, (LLWU_RD_FILT4(base) & ~(mask)) | (value)))
#define LLWU_SET_FILT4(base, value) (LLWU_WR_FILT4(base, LLWU_RD_FILT4(base) |  (value)))
#define LLWU_CLR_FILT4(base, value) (LLWU_WR_FILT4(base, LLWU_RD_FILT4(base) & ~(value)))
#define LLWU_TOG_FILT4(base, value) (LLWU_WR_FILT4(base, LLWU_RD_FILT4(base) ^  (value)))
/*@}*/

