RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*
 * Constants & macros for individual LMEM_PCCRMR bitfields
 */

/*!
 * @name Register LMEM_PCCRMR, field R15[1:0] (RW)
 *
 * Controls the cache mode for region 15
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R15 field. */
#define LMEM_RD_PCCRMR_R15(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R15_MASK) >> LMEM_PCCRMR_R15_SHIFT)
#define LMEM_BRD_PCCRMR_R15(base) (LMEM_RD_PCCRMR_R15(base))

/*! @brief Set the R15 field to a new value. */
#define LMEM_WR_PCCRMR_R15(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R15_MASK, LMEM_PCCRMR_R15(value)))
#define LMEM_BWR_PCCRMR_R15(base, value) (LMEM_WR_PCCRMR_R15(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R14[3:2] (RW)
 *
 * Controls the cache mode for region 14
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R14 field. */
#define LMEM_RD_PCCRMR_R14(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R14_MASK) >> LMEM_PCCRMR_R14_SHIFT)
#define LMEM_BRD_PCCRMR_R14(base) (LMEM_RD_PCCRMR_R14(base))

/*! @brief Set the R14 field to a new value. */
#define LMEM_WR_PCCRMR_R14(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R14_MASK, LMEM_PCCRMR_R14(value)))
#define LMEM_BWR_PCCRMR_R14(base, value) (LMEM_WR_PCCRMR_R14(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R13 field. */
#define LMEM_RD_PCCRMR_R13(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R13_MASK) >> LMEM_PCCRMR_R13_SHIFT)
#define LMEM_BRD_PCCRMR_R13(base) (LMEM_RD_PCCRMR_R13(base))

/*! @brief Set the R13 field to a new value. */
#define LMEM_WR_PCCRMR_R13(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R13_MASK, LMEM_PCCRMR_R13(value)))
#define LMEM_BWR_PCCRMR_R13(base, value) (LMEM_WR_PCCRMR_R13(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R12[7:6] (RW)
 *
 * Controls the cache mode for region 12
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R12 field. */
#define LMEM_RD_PCCRMR_R12(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R12_MASK) >> LMEM_PCCRMR_R12_SHIFT)
#define LMEM_BRD_PCCRMR_R12(base) (LMEM_RD_PCCRMR_R12(base))

/*! @brief Set the R12 field to a new value. */
#define LMEM_WR_PCCRMR_R12(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R12_MASK, LMEM_PCCRMR_R12(value)))
#define LMEM_BWR_PCCRMR_R12(base, value) (LMEM_WR_PCCRMR_R12(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R11[9:8] (RW)
 *
 * Controls the cache mode for region 11
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R11 field. */
#define LMEM_RD_PCCRMR_R11(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R11_MASK) >> LMEM_PCCRMR_R11_SHIFT)
#define LMEM_BRD_PCCRMR_R11(base) (LMEM_RD_PCCRMR_R11(base))

/*! @brief Set the R11 field to a new value. */
#define LMEM_WR_PCCRMR_R11(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R11_MASK, LMEM_PCCRMR_R11(value)))
#define LMEM_BWR_PCCRMR_R11(base, value) (LMEM_WR_PCCRMR_R11(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R10[11:10] (RW)
 *
 * Controls the cache mode for region 10
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R10 field. */
#define LMEM_RD_PCCRMR_R10(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R10_MASK) >> LMEM_PCCRMR_R10_SHIFT)
#define LMEM_BRD_PCCRMR_R10(base) (LMEM_RD_PCCRMR_R10(base))

/*! @brief Set the R10 field to a new value. */
#define LMEM_WR_PCCRMR_R10(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R10_MASK, LMEM_PCCRMR_R10(value)))
#define LMEM_BWR_PCCRMR_R10(base, value) (LMEM_WR_PCCRMR_R10(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R9[13:12] (RW)
 *
 * Controls the cache mode for region 9
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R9 field. */
#define LMEM_RD_PCCRMR_R9(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R9_MASK) >> LMEM_PCCRMR_R9_SHIFT)
#define LMEM_BRD_PCCRMR_R9(base) (LMEM_RD_PCCRMR_R9(base))

/*! @brief Set the R9 field to a new value. */
#define LMEM_WR_PCCRMR_R9(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R9_MASK, LMEM_PCCRMR_R9(value)))
#define LMEM_BWR_PCCRMR_R9(base, value) (LMEM_WR_PCCRMR_R9(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R8[15:14] (RW)
 *
 * Controls the cache mode for region 8
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R8 field. */
#define LMEM_RD_PCCRMR_R8(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R8_MASK) >> LMEM_PCCRMR_R8_SHIFT)
#define LMEM_BRD_PCCRMR_R8(base) (LMEM_RD_PCCRMR_R8(base))

/*! @brief Set the R8 field to a new value. */
#define LMEM_WR_PCCRMR_R8(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R8_MASK, LMEM_PCCRMR_R8(value)))
#define LMEM_BWR_PCCRMR_R8(base, value) (LMEM_WR_PCCRMR_R8(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R7[17:16] (RW)
 *
 * Controls the cache mode for region 7
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R7 field. */
#define LMEM_RD_PCCRMR_R7(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R7_MASK) >> LMEM_PCCRMR_R7_SHIFT)
#define LMEM_BRD_PCCRMR_R7(base) (LMEM_RD_PCCRMR_R7(base))

