RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*
 * Constants & macros for individual MCG_S2 bitfields
 */

/*!
 * @name Register MCG_S2, field PLLCST[4] (RO)
 *
 * The PLLCST indicates the PLL clock selected by PLLCS. The PLLCST bit does not
 * updated immediately after a write to the PLLCS bit due internal
 * synchronization between clock domains.
 *
 * Values:
 * - 0b0 - Source of PLLCS is PLL clock.
 * - 0b1 - Source of PLLCS is EXT_PLL clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_PLLCST field. */
#define MCG_RD_S2_PLLCST(base) ((MCG_S2_REG(base) & MCG_S2_PLLCST_MASK) >> MCG_S2_PLLCST_SHIFT)
#define MCG_BRD_S2_PLLCST(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_PLLCST_SHIFT))
/*@}*/

/* MCG C5[PLLCLKEN0] backward compatibility */
#define MCG_RD_C5_PLLCLKEN0(base)         (MCG_RD_C5_PLLCLKEN(base))
#define MCG_BRD_C5_PLLCLKEN0(base)        (MCG_BRD_C5_PLLCLKEN(base))
#define MCG_WR_C5_PLLCLKEN0(base, value)  (MCG_WR_C5_PLLCLKEN((base), (value)))
#define MCG_BWR_C5_PLLCLKEN0(base, value) (MCG_BWR_C5_PLLCLKEN((base), (value)))
/* MCG C5[PLLSTEN0] backward compatibility */
#define MCG_RD_C5_PLLSTEN0(base)         (MCG_RD_C5_PLLSTEN(base))
#define MCG_BRD_C5_PLLSTEN0(base)        (MCG_BRD_C5_PLLSTEN(base))
#define MCG_WR_C5_PLLSTEN0(base, value)  (MCG_WR_C5_PLLSTEN((base), (value)))
#define MCG_BWR_C5_PLLSTEN0(base, value) (MCG_BWR_C5_PLLSTEN((base), (value)))
/* MCG C5[PRDIV0] backward compatibility */
#define MCG_RD_C5_PRDIV0(base)         (MCG_RD_C5_PRDIV(base))
#define MCG_BRD_C5_PRDIV0(base)        (MCG_BRD_C5_PRDIV(base))
#define MCG_WR_C5_PRDIV0(base, value)  (MCG_WR_C5_PRDIV((base), (value)))
#define MCG_BWR_C5_PRDIV0(base, value) (MCG_BWR_C5_PRDIV((base), (value)))
/* MCG C6[VDIV0] backward compatibility */
#define MCG_RD_C6_VDIV0(base)         (MCG_RD_C6_VDIV(base))
#define MCG_BRD_C6_VDIV0(base)        (MCG_BRD_C6_VDIV(base))
#define MCG_WR_C6_VDIV0(base, value)  (MCG_WR_C6_VDIV((base), (value)))
#define MCG_BWR_C6_VDIV0(base, value) (MCG_BWR_C6_VDIV((base), (value)))

/*
 * MK65F18 MCM
 *
 * Core Platform Miscellaneous Control Module
 *
 * Registers defined in this header file:
 * - MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 * - MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration
 * - MCM_CR - Control Register
 * - MCM_ISCR - Interrupt Status Register
 * - MCM_ETBCC - ETB Counter Control register
 * - MCM_ETBRL - ETB Reload register
 * - MCM_ETBCNT - ETB Counter Value register
 * - MCM_FADR - Fault address register
 * - MCM_FATR - Fault attributes register
 * - MCM_FDR - Fault data register
 * - MCM_PID - Process ID register
 * - MCM_CPO - Compute Operation Control Register
 */

#define MCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MCM module. */
#define MCM_IDX (0U) /*!< Instance number for MCM. */

/*******************************************************************************
 * MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 ******************************************************************************/

/*!
 * @brief MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration (RO)
 *
 * Reset value: 0x001FU
 *
 * PLASC is a 16-bit read-only register identifying the presence/absence of bus
 * slave connections to the device's crossbar switch.
 */
/*!
 * @name Constants and macros for entire MCM_PLASC register
 */
/*@{*/
#define MCM_RD_PLASC(base)       (MCM_PLASC_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_PLASC bitfields
 */

/*!
 * @name Register MCM_PLASC, field ASC[7:0] (RO)
 *
 * Values:
 * - 0b00000000 - A bus slave connection to AXBS input port n is absent
 * - 0b00000001 - A bus slave connection to AXBS input port n is present
 */
/*@{*/
/*! @brief Read current value of the MCM_PLASC_ASC field. */
#define MCM_RD_PLASC_ASC(base) ((MCM_PLASC_REG(base) & MCM_PLASC_ASC_MASK) >> MCM_PLASC_ASC_SHIFT)
#define MCM_BRD_PLASC_ASC(base) (MCM_RD_PLASC_ASC(base))
/*@}*/

/*******************************************************************************
 * MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration
 ******************************************************************************/

/*!
 * @brief MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration (RO)
 *
 * Reset value: 0x007FU
 *
 * PLAMC is a 16-bit read-only register identifying the presence/absence of bus
 * master connections to the device's crossbar switch.
 */
/*!
 * @name Constants and macros for entire MCM_PLAMC register
 */
/*@{*/
#define MCM_RD_PLAMC(base)       (MCM_PLAMC_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_PLAMC bitfields
 */

/*!
 * @name Register MCM_PLAMC, field AMC[7:0] (RO)
 *
 * Values:
 * - 0b00000000 - A bus master connection to AXBS input port n is absent
 * - 0b00000001 - A bus master connection to AXBS input port n is present
 */
/*@{*/
/*! @brief Read current value of the MCM_PLAMC_AMC field. */
#define MCM_RD_PLAMC_AMC(base) ((MCM_PLAMC_REG(base) & MCM_PLAMC_AMC_MASK) >> MCM_PLAMC_AMC_SHIFT)
#define MCM_BRD_PLAMC_AMC(base) (MCM_RD_PLAMC_AMC(base))
/*@}*/

/*******************************************************************************
 * MCM_CR - Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * CR defines the arbitration and protection schemes for the two system RAM
 * arrays.
 */
/*!
 * @name Constants and macros for entire MCM_CR register
 */
/*@{*/
#define MCM_RD_CR(base)          (MCM_CR_REG(base))
#define MCM_WR_CR(base, value)   (MCM_CR_REG(base) = (value))
#define MCM_RMW_CR(base, mask, value) (MCM_WR_CR(base, (MCM_RD_CR(base) & ~(mask)) | (value)))
#define MCM_SET_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) |  (value)))
#define MCM_CLR_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) & ~(value)))
#define MCM_TOG_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CR bitfields
 */

/*!
 * @name Register MCM_CR, field SRAMUAP[25:24] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_U array.
 *
 * Values:
 * - 0b00 - Round robin
 * - 0b01 - Special round robin (favors SRAM backoor accesses over the processor)
 * - 0b10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 0b11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_SRAMUAP field. */
#define MCM_RD_CR_SRAMUAP(base) ((MCM_CR_REG(base) & MCM_CR_SRAMUAP_MASK) >> MCM_CR_SRAMUAP_SHIFT)
#define MCM_BRD_CR_SRAMUAP(base) (MCM_RD_CR_SRAMUAP(base))

/*! @brief Set the SRAMUAP field to a new value. */
#define MCM_WR_CR_SRAMUAP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMUAP_MASK, MCM_CR_SRAMUAP(value)))
#define MCM_BWR_CR_SRAMUAP(base, value) (MCM_WR_CR_SRAMUAP(base, value))
/*@}*/

/*!
 * @name Register MCM_CR, field SRAMUWP[26] (RW)
 *
 * When this bit is set, writes to SRAM_U array generates a bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_SRAMUWP field. */
#define MCM_RD_CR_SRAMUWP(base) ((MCM_CR_REG(base) & MCM_CR_SRAMUWP_MASK) >> MCM_CR_SRAMUWP_SHIFT)
#define MCM_BRD_CR_SRAMUWP(base) (MCM_RD_CR_SRAMUWP(base))

/*! @brief Set the SRAMUWP field to a new value. */
#define MCM_WR_CR_SRAMUWP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMUWP_MASK, MCM_CR_SRAMUWP(value)))
#define MCM_BWR_CR_SRAMUWP(base, value) (MCM_WR_CR_SRAMUWP(base, value))
/*@}*/

/*!
 * @name Register MCM_CR, field SRAMLAP[29:28] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_L array.
 *
 * Values:
 * - 0b00 - Round robin
 * - 0b01 - Special round robin (favors SRAM backoor accesses over the processor)
 * - 0b10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 0b11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_SRAMLAP field. */
#define MCM_RD_CR_SRAMLAP(base) ((MCM_CR_REG(base) & MCM_CR_SRAMLAP_MASK) >> MCM_CR_SRAMLAP_SHIFT)
#define MCM_BRD_CR_SRAMLAP(base) (MCM_RD_CR_SRAMLAP(base))

