RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * USBDCD_TIMER2_BC12 - TIMER2_BC12 register
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER2_BC12 - TIMER2_BC12 register (RW)
 *
 * Reset value: 0x00010028U
 *
 * TIMER2_BC12 contains timing parameters for USB Battery Charging
 * Specification, v1.2. Register values can be written that are not compliant with the USB
 * Battery Charging Specification, so care should be taken when overwriting the
 * default values.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER2_BC12 register
 */
/*@{*/
#define USBDCD_RD_TIMER2_BC12(base) (USBDCD_TIMER2_BC12_REG(base))
#define USBDCD_WR_TIMER2_BC12(base, value) (USBDCD_TIMER2_BC12_REG(base) = (value))
#define USBDCD_RMW_TIMER2_BC12(base, mask, value) (USBDCD_WR_TIMER2_BC12(base, (USBDCD_RD_TIMER2_BC12(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) |  (value)))
#define USBDCD_CLR_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) & ~(value)))
#define USBDCD_TOG_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2_BC12 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2_BC12, field TVDMSRC_ON[9:0] (RW)
 *
 * Sets the amount of time (in ms) that the module enables the VDM_SRC. Valid
 * values are 0-40ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC12_TVDMSRC_ON field. */
#define USBDCD_RD_TIMER2_BC12_TVDMSRC_ON(base) ((USBDCD_TIMER2_BC12_REG(base) & USBDCD_TIMER2_BC12_TVDMSRC_ON_MASK) >> USBDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT)
#define USBDCD_BRD_TIMER2_BC12_TVDMSRC_ON(base) (USBDCD_RD_TIMER2_BC12_TVDMSRC_ON(base))

/*! @brief Set the TVDMSRC_ON field to a new value. */
#define USBDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBDCD_RMW_TIMER2_BC12(base, USBDCD_TIMER2_BC12_TVDMSRC_ON_MASK, USBDCD_TIMER2_BC12_TVDMSRC_ON(value)))
#define USBDCD_BWR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2_BC12, field TWAIT_AFTER_PRD[25:16] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after primary detection
 * before start to secondary detection. Valid values are 1-1023ms. Default is
 * 1ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD field. */
#define USBDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base) ((USBDCD_TIMER2_BC12_REG(base) & USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK) >> USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT)
#define USBDCD_BRD_TIMER2_BC12_TWAIT_AFTER_PRD(base) (USBDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base))

/*! @brief Set the TWAIT_AFTER_PRD field to a new value. */
#define USBDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBDCD_RMW_TIMER2_BC12(base, USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK, USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD(value)))
#define USBDCD_BWR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value))
/*@}*/

/*
 * MK65F18 USBHS
 *
 * USB HS/FS/LS OTG Controller
 *
 * Registers defined in this header file:
 * - USBHS_ID - Identification Register
 * - USBHS_HWGENERAL - General Hardware Parameters Register
 * - USBHS_HWHOST - Host Hardware Parameters Register
 * - USBHS_HWDEVICE - Device Hardware Parameters Register
 * - USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register
 * - USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register
 * - USBHS_GPTIMER0LD - General Purpose Timer n Load Register
 * - USBHS_GPTIMER0CTL - General Purpose Timer n Control Register
 * - USBHS_GPTIMER1LD - General Purpose Timer n Load Register
 * - USBHS_GPTIMER1CTL - General Purpose Timer n Control Register
 * - USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
 * - USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
 * - USBHS_HCSPARAMS - Host Controller Structural Parameters Register
 * - USBHS_HCCPARAMS - Host Controller Capability Parameters Register
 * - USBHS_DCIVERSION - Device Controller Interface Version
 * - USBHS_DCCPARAMS - Device Controller Capability Parameters
 * - USBHS_USBCMD - USB Command Register
 * - USBHS_USBSTS - USB Status Register
 * - USBHS_USBINTR - USB Interrupt Enable Register
 * - USBHS_FRINDEX - Frame Index Register
 * - USBHS_DEVICEADDR - Device Address Register
 * - USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
 * - USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register
 * - USBHS_EPLISTADDR - Endpoint List Address Register
 * - USBHS_TTCTRL - Host TT Asynchronous Buffer Control
 * - USBHS_BURSTSIZE - Master Interface Data Burst Size Register
 * - USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register
 * - USBHS_ENDPTNAK - Endpoint NAK Register
 * - USBHS_ENDPTNAKEN - Endpoint NAK Enable Register
 * - USBHS_CONFIGFLAG - Configure Flag Register
 * - USBHS_PORTSC1 - Port Status and Control Registers
 * - USBHS_OTGSC - On-the-Go Status and Control Register
 * - USBHS_USBMODE - USB Mode Register
 * - USBHS_EPSETUPSR - Endpoint Setup Status Register
 * - USBHS_EPPRIME - Endpoint Initialization Register
 * - USBHS_EPFLUSH - Endpoint Flush Register
 * - USBHS_EPSR - Endpoint Status Register
 * - USBHS_EPCOMPLETE - Endpoint Complete Register
 * - USBHS_EPCR0 - Endpoint Control Register 0
 * - USBHS_EPCR - Endpoint Control Register n
 * - USBHS_USBGENCTRL - USB General Control Register
 */

#define USBHS_INSTANCE_COUNT (1U) /*!< Number of instances of the USBHS module. */
#define USBHS_IDX (0U) /*!< Instance number for USBHS. */

/*******************************************************************************
 * USBHS_ID - Identification Register
 ******************************************************************************/

/*!
 * @brief USBHS_ID - Identification Register (RO)
 *
 * Reset value: 0xE461FA05U
 *
 * The ID register provides a simple way to determine if the module is provided
 * in the system. The ID register identifies the module and its revision.
 */
/*!
 * @name Constants and macros for entire USBHS_ID register
 */
/*@{*/
#define USBHS_RD_ID(base)        (USBHS_ID_REG(base))
/*@}*/

