RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * USBHS_HWDEVICE - Device Hardware Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HWDEVICE - Device Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000009U
 *
 * Provides device hardware parameters for this implementation of the USBHS
 * module.
 */
/*!
 * @name Constants and macros for entire USBHS_HWDEVICE register
 */
/*@{*/
#define USBHS_RD_HWDEVICE(base)  (USBHS_HWDEVICE_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HWDEVICE bitfields
 */

/*!
 * @name Register USBHS_HWDEVICE, field DC[0] (RO)
 *
 * Always reads as 0b1, indicating the USBHS module is device capable.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWDEVICE_DC field. */
#define USBHS_RD_HWDEVICE_DC(base) ((USBHS_HWDEVICE_REG(base) & USBHS_HWDEVICE_DC_MASK) >> USBHS_HWDEVICE_DC_SHIFT)
#define USBHS_BRD_HWDEVICE_DC(base) (BITBAND_ACCESS32(&USBHS_HWDEVICE_REG(base), USBHS_HWDEVICE_DC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HWDEVICE, field DEVEP[5:1] (RO)
 *
 * The number of supported endpoints. Always reads as 0b01000.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWDEVICE_DEVEP field. */
#define USBHS_RD_HWDEVICE_DEVEP(base) ((USBHS_HWDEVICE_REG(base) & USBHS_HWDEVICE_DEVEP_MASK) >> USBHS_HWDEVICE_DEVEP_SHIFT)
#define USBHS_BRD_HWDEVICE_DEVEP(base) (USBHS_RD_HWDEVICE_DEVEP(base))
/*@}*/

/*******************************************************************************
 * USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register (RO)
 *
 * Reset value: 0x80070908U
 *
 * The HWTXBUF register provides the transmit buffer parameters for this
 * implementation of the module.
 */
/*!
 * @name Constants and macros for entire USBHS_HWTXBUF register
 */
/*@{*/
#define USBHS_RD_HWTXBUF(base)   (USBHS_HWTXBUF_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HWTXBUF bitfields
 */

/*!
 * @name Register USBHS_HWTXBUF, field TXBURST[7:0] (RO)
 *
 * Indicates the number of data beats in a burst for transmit DMA data
 * transfers. Always 0x8.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWTXBUF_TXBURST field. */
#define USBHS_RD_HWTXBUF_TXBURST(base) ((USBHS_HWTXBUF_REG(base) & USBHS_HWTXBUF_TXBURST_MASK) >> USBHS_HWTXBUF_TXBURST_SHIFT)
#define USBHS_BRD_HWTXBUF_TXBURST(base) (USBHS_RD_HWTXBUF_TXBURST(base))
/*@}*/

/*!
 * @name Register USBHS_HWTXBUF, field TXADD[15:8] (RO)
 *
 * The number of address bits for the entire TX buffer. Always 0x9.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWTXBUF_TXADD field. */
#define USBHS_RD_HWTXBUF_TXADD(base) ((USBHS_HWTXBUF_REG(base) & USBHS_HWTXBUF_TXADD_MASK) >> USBHS_HWTXBUF_TXADD_SHIFT)
#define USBHS_BRD_HWTXBUF_TXADD(base) (USBHS_RD_HWTXBUF_TXADD(base))
/*@}*/

/*!
 * @name Register USBHS_HWTXBUF, field TXCHANADD[23:16] (RO)
 *
 * The number of address bits required to address one channel's worth of TX
 * data. Always 0x7.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWTXBUF_TXCHANADD field. */
#define USBHS_RD_HWTXBUF_TXCHANADD(base) ((USBHS_HWTXBUF_REG(base) & USBHS_HWTXBUF_TXCHANADD_MASK) >> USBHS_HWTXBUF_TXCHANADD_SHIFT)
#define USBHS_BRD_HWTXBUF_TXCHANADD(base) (USBHS_RD_HWTXBUF_TXCHANADD(base))
/*@}*/

/*!
 * @name Register USBHS_HWTXBUF, field TXLC[31] (RO)
 *
 * Indicates how the device transmit context registers implement. Always set.
 *
 * Values:
 * - 0b0 - Store device transmit contexts in the TX FIFO
 * - 0b1 - Store device transmit contexts in a register file
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWTXBUF_TXLC field. */
#define USBHS_RD_HWTXBUF_TXLC(base) ((USBHS_HWTXBUF_REG(base) & USBHS_HWTXBUF_TXLC_MASK) >> USBHS_HWTXBUF_TXLC_SHIFT)
#define USBHS_BRD_HWTXBUF_TXLC(base) (BITBAND_ACCESS32(&USBHS_HWTXBUF_REG(base), USBHS_HWTXBUF_TXLC_SHIFT))
/*@}*/

/*******************************************************************************
 * USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000808U
 *
 * The HWRXBUF register provide the receive buffer parameters for this
 * implementation of the module.
 */
/*!
 * @name Constants and macros for entire USBHS_HWRXBUF register
 */
/*@{*/
#define USBHS_RD_HWRXBUF(base)   (USBHS_HWRXBUF_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HWRXBUF bitfields
 */

/*!
 * @name Register USBHS_HWRXBUF, field RXBURST[7:0] (RO)
 *
 * Indicates the number of data beats in a burst for receive DMA data transfers.
 * Always reads as 0x08.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWRXBUF_RXBURST field. */
#define USBHS_RD_HWRXBUF_RXBURST(base) ((USBHS_HWRXBUF_REG(base) & USBHS_HWRXBUF_RXBURST_MASK) >> USBHS_HWRXBUF_RXBURST_SHIFT)
#define USBHS_BRD_HWRXBUF_RXBURST(base) (USBHS_RD_HWRXBUF_RXBURST(base))
/*@}*/

/*!
 * @name Register USBHS_HWRXBUF, field RXADD[15:8] (RO)
 *
 * The number of address bits for the entire RX buffer. Always reads as 0x08.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWRXBUF_RXADD field. */
#define USBHS_RD_HWRXBUF_RXADD(base) ((USBHS_HWRXBUF_REG(base) & USBHS_HWRXBUF_RXADD_MASK) >> USBHS_HWRXBUF_RXADD_SHIFT)
#define USBHS_BRD_HWRXBUF_RXADD(base) (USBHS_RD_HWRXBUF_RXADD(base))
/*@}*/

/*******************************************************************************
 * USBHS_GPTIMER0LD - General Purpose Timer n Load Register
 ******************************************************************************/

/*!
 * @brief USBHS_GPTIMER0LD - General Purpose Timer n Load Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnLD register contains the timer duration or load value.
 */
/*!
 * @name Constants and macros for entire USBHS_GPTIMER0LD register
 */
/*@{*/
#define USBHS_RD_GPTIMER0LD(base) (USBHS_GPTIMER0LD_REG(base))
#define USBHS_WR_GPTIMER0LD(base, value) (USBHS_GPTIMER0LD_REG(base) = (value))
#define USBHS_RMW_GPTIMER0LD(base, mask, value) (USBHS_WR_GPTIMER0LD(base, (USBHS_RD_GPTIMER0LD(base) & ~(mask)) | (value)))
#define USBHS_SET_GPTIMER0LD(base, value) (USBHS_WR_GPTIMER0LD(base, USBHS_RD_GPTIMER0LD(base) |  (value)))
#define USBHS_CLR_GPTIMER0LD(base, value) (USBHS_WR_GPTIMER0LD(base, USBHS_RD_GPTIMER0LD(base) & ~(value)))
#define USBHS_TOG_GPTIMER0LD(base, value) (USBHS_WR_GPTIMER0LD(base, USBHS_RD_GPTIMER0LD(base) ^  (value)))
/*@}*/

