RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*
 * Constants & macros for individual USBHS_GPTIMER1LD bitfields
 */

/*!
 * @name Register USBHS_GPTIMER1LD, field GPTLD[23:0] (RW)
 *
 * Specifies the value to be loaded into the countdown timer on a reset. The
 * value in this register represents the time in microseconds minus 1 for the timer
 * duration. For example, for a one millisecond timer, load 1000 - 1 = 999
 * (0x00_03E7). Maximum value is 0xFF_FFFF or 16.777215 seconds.
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1LD_GPTLD field. */
#define USBHS_RD_GPTIMER1LD_GPTLD(base) ((USBHS_GPTIMER1LD_REG(base) & USBHS_GPTIMER1LD_GPTLD_MASK) >> USBHS_GPTIMER1LD_GPTLD_SHIFT)
#define USBHS_BRD_GPTIMER1LD_GPTLD(base) (USBHS_RD_GPTIMER1LD_GPTLD(base))

/*! @brief Set the GPTLD field to a new value. */
#define USBHS_WR_GPTIMER1LD_GPTLD(base, value) (USBHS_RMW_GPTIMER1LD(base, USBHS_GPTIMER1LD_GPTLD_MASK, USBHS_GPTIMER1LD_GPTLD(value)))
#define USBHS_BWR_GPTIMER1LD_GPTLD(base, value) (USBHS_WR_GPTIMER1LD_GPTLD(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_GPTIMER1CTL - General Purpose Timer n Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_GPTIMER1CTL - General Purpose Timer n Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnCTL register controls the various functions of the general
 * purpose timers.
 */
/*!
 * @name Constants and macros for entire USBHS_GPTIMER1CTL register
 */
/*@{*/
#define USBHS_RD_GPTIMER1CTL(base) (USBHS_GPTIMER1CTL_REG(base))
#define USBHS_WR_GPTIMER1CTL(base, value) (USBHS_GPTIMER1CTL_REG(base) = (value))
#define USBHS_RMW_GPTIMER1CTL(base, mask, value) (USBHS_WR_GPTIMER1CTL(base, (USBHS_RD_GPTIMER1CTL(base) & ~(mask)) | (value)))
#define USBHS_SET_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) |  (value)))
#define USBHS_CLR_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) & ~(value)))
#define USBHS_TOG_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_GPTIMER1CTL bitfields
 */

/*!
 * @name Register USBHS_GPTIMER1CTL, field GPTCNT[23:0] (RO)
 *
 * Indicates the current value of the running timer.
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_GPTCNT field. */
#define USBHS_RD_GPTIMER1CTL_GPTCNT(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_GPTCNT_MASK) >> USBHS_GPTIMER1CTL_GPTCNT_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_GPTCNT(base) (USBHS_RD_GPTIMER1CTL_GPTCNT(base))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field MODE[24] (RW)
 *
 * Selects between a single timer countdown and a looped countdown. In one-shot
 * mode, the timer counts down to zero, generates an interrupt, and stops until
 * the counter is reset by software. In repeat mode, the timer counts down to
 * zero, generates an interrupt, and automatically reloads the counter and begins
 * another countdown.
 *
 * Values:
 * - 0b0 - One shot
 * - 0b1 - Repeat
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_MODE field. */
#define USBHS_RD_GPTIMER1CTL_MODE(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_MODE_MASK) >> USBHS_GPTIMER1CTL_MODE_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_MODE(base) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_MODE_SHIFT))

/*! @brief Set the MODE field to a new value. */
#define USBHS_WR_GPTIMER1CTL_MODE(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_MODE_MASK, USBHS_GPTIMER1CTL_MODE(value)))
#define USBHS_BWR_GPTIMER1CTL_MODE(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field RST[30] (WO)
 *
 * Setting this bit reloads GPTCNT with the value in GPTIMERnLD[GPTLD].
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Load counter value
 */
/*@{*/
/*! @brief Set the RST field to a new value. */
#define USBHS_WR_GPTIMER1CTL_RST(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_RST_MASK, USBHS_GPTIMER1CTL_RST(value)))
#define USBHS_BWR_GPTIMER1CTL_RST(base, value) (USBHS_WR_GPTIMER1CTL_RST(base, value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field RUN[31] (RW)
 *
 * Enables the general purpose timer. Setting or clearing this bit does not have
 * an effect on the GPTCNT field.
 *
 * Values:
 * - 0b0 - Timer stop
 * - 0b1 - Timer run
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_RUN field. */
#define USBHS_RD_GPTIMER1CTL_RUN(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_RUN_MASK) >> USBHS_GPTIMER1CTL_RUN_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_RUN(base) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_RUN_SHIFT))

/*! @brief Set the RUN field to a new value. */
#define USBHS_WR_GPTIMER1CTL_RUN(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_RUN_MASK, USBHS_GPTIMER1CTL_RUN(value)))
#define USBHS_BWR_GPTIMER1CTL_RUN(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_RUN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
 ******************************************************************************/

/*!
 * @brief USBHS_USB_SBUSCFG - System Bus Interface Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The System Bus Interface Configuration (USB_SBUSCFG) register contains the
 * control for the system bus interface.
 */
/*!
 * @name Constants and macros for entire USBHS_USB_SBUSCFG register
 */
/*@{*/
#define USBHS_RD_USB_SBUSCFG(base) (USBHS_USB_SBUSCFG_REG(base))
#define USBHS_WR_USB_SBUSCFG(base, value) (USBHS_USB_SBUSCFG_REG(base) = (value))
#define USBHS_RMW_USB_SBUSCFG(base, mask, value) (USBHS_WR_USB_SBUSCFG(base, (USBHS_RD_USB_SBUSCFG(base) & ~(mask)) | (value)))
#define USBHS_SET_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) |  (value)))
#define USBHS_CLR_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) & ~(value)))
#define USBHS_TOG_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) ^  (value)))
/*@}*/

