RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the URI field to a new value. */
#define USBHS_WR_USBSTS_URI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_URI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_URI(value)))
#define USBHS_BWR_USBSTS_URI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_URI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field SRI[7] (W1C)
 *
 * This is a non-EHCI status bit. Software writes a 1 to this bit to clear it.
 * Host mode: In host mode, this bit is set every 125 ms, provided PHY clock is
 * present and running (for example, the port is NOT suspended) and can be used by
 * the host-controller driver as a time base. Device mode: When controller
 * detects a start of (micro) frame, bit is set. When a SOF is extremely late,
 * controller automatically sets this bit to indicate an SOF was expected. Therefore,
 * this bit is set roughly every 1 ms in device FS mode and every 125 us in HS mode,
 * and it is synchronized to the actual SOF received. Because the controller is
 * initialized to FS before connect, this bit is set at an interval of 1 ms
 * during the prelude to the connect and chirp.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_SRI field. */
#define USBHS_RD_USBSTS_SRI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_SRI_MASK) >> USBHS_USBSTS_SRI_SHIFT)
#define USBHS_BRD_USBSTS_SRI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SRI_SHIFT))

/*! @brief Set the SRI field to a new value. */
#define USBHS_WR_USBSTS_SRI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_SRI(value)))
#define USBHS_BWR_USBSTS_SRI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SRI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field SLI[8] (W1C)
 *
 * Non-EHCI bit. When a device controller enters a suspend state from an active
 * state, this bit is set. The device controller clears the bit upon exiting from
 * a suspend state. Used only by the device controller.
 *
 * Values:
 * - 0b0 - Active
 * - 0b1 - Suspended
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_SLI field. */
#define USBHS_RD_USBSTS_SLI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_SLI_MASK) >> USBHS_USBSTS_SLI_SHIFT)
#define USBHS_BRD_USBSTS_SLI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SLI_SHIFT))

/*! @brief Set the SLI field to a new value. */
#define USBHS_WR_USBSTS_SLI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_SLI(value)))
#define USBHS_BWR_USBSTS_SLI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SLI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field HCH[12] (RO)
 *
 * This bit is cleared when the USBCMD[RS] bit is set. The controller sets this
 * bit after it stops executing because of the USBCMD[RS] bit being cleared, by
 * software or the host controller hardware (for example, internal error). Used
 * only in host mode.
 *
 * Values:
 * - 0b0 - Running
 * - 0b1 - Halted
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_HCH field. */
#define USBHS_RD_USBSTS_HCH(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_HCH_MASK) >> USBHS_USBSTS_HCH_SHIFT)
#define USBHS_BRD_USBSTS_HCH(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_HCH_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field RCL[13] (RO)
 *
 * Detects an empty asynchronous schedule. Used only by the host mode.
 *
 * Values:
 * - 0b0 - Non-empty asynchronous schedule
 * - 0b1 - Empty asynchronous schedule
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_RCL field. */
#define USBHS_RD_USBSTS_RCL(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_RCL_MASK) >> USBHS_USBSTS_RCL_SHIFT)
#define USBHS_BRD_USBSTS_RCL(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_RCL_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field PS[14] (RO)
 *
 * Reports current real status of periodic schedule. Controller is not
 * immediately required to disable or enable the periodic schedule when software
 * transitions the USBCMD[PSE] bit. When this bit and the USBCMD[PSE] bit have the same
 * value, the periodic schedule is enabled or disabled. Used only in host mode.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_PS field. */
#define USBHS_RD_USBSTS_PS(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_PS_MASK) >> USBHS_USBSTS_PS_SHIFT)
#define USBHS_BRD_USBSTS_PS(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_PS_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field AS[15] (RO)
 *
 * Reports the current real status of asynchronous schedule. Controller is not
 * immediately required to disable or enable the asynchronous schedule when
 * software transitions the USBCMD[ASE] bit. When this bit and the USBCMD[ASE] bit have
 * the same value, the asynchronous schedule is enabled (1) or disabled (0).
 * Used only in host mode.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_AS field. */
#define USBHS_RD_USBSTS_AS(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_AS_MASK) >> USBHS_USBSTS_AS_SHIFT)
#define USBHS_BRD_USBSTS_AS(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_AS_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field NAKI[16] (RO)
 *
 * Set by hardware for a particular endpoint when the TX/RX endpoint's NAK bit
 * and the corresponding TX/RX endpoint's NAK enable bit are set. The hardware
 * automatically clears this bit when all the enabled TX/RX endpoint NAK bits are
 * cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_NAKI field. */
#define USBHS_RD_USBSTS_NAKI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_NAKI_MASK) >> USBHS_USBSTS_NAKI_SHIFT)
#define USBHS_BRD_USBSTS_NAKI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_NAKI_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field UAI[18] (RW)
 *
 * Set by the host controller when the cause of an interrupt is a completion of
 * a USB transaction where the transfer descriptor (TD) has an interrupt on
 * complete (IOC) bit set and the TD was from the asynchronous schedule. This bit is
 * also set by the host controller when a short packet is detected and the packet
 * is on the asynchronous schedule. A short packet is when the actual number of
 * bytes received was less than the expected number of bytes. This bit is not used
 * by the device controller and is always zero.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_UAI field. */
#define USBHS_RD_USBSTS_UAI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_UAI_MASK) >> USBHS_USBSTS_UAI_SHIFT)
#define USBHS_BRD_USBSTS_UAI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UAI_SHIFT))

/*! @brief Set the UAI field to a new value. */
#define USBHS_WR_USBSTS_UAI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_UAI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_UAI(value)))
#define USBHS_BWR_USBSTS_UAI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UAI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field UPI[19] (RW)
 *
 * Set by the host controller when the cause of an interrupt is a completion of
 * a USB transaction where the transfer descriptor (TD) has an interrupt on
 * complete (IOC) bit set and the TD was from the periodic schedule. This bit is also
 * set by the host controller when a short packet is detected and the packet is
 * on the periodic schedule. A short packet is when the actual number of bytes
 * received was less than the expected number of bytes. This bit is not used by the
 * device controller and is always zero.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_UPI field. */
#define USBHS_RD_USBSTS_UPI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_UPI_MASK) >> USBHS_USBSTS_UPI_SHIFT)
#define USBHS_BRD_USBSTS_UPI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UPI_SHIFT))

/*! @brief Set the UPI field to a new value. */
#define USBHS_WR_USBSTS_UPI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_UPI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_UPI(value)))
#define USBHS_BWR_USBSTS_UPI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UPI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field TI0[24] (W1C)
 *
 * Set when the counter in the GPTIMER0CTRL register transitions to zero.
 * Writing a one to this bit clears it.
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_TI0 field. */
#define USBHS_RD_USBSTS_TI0(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_TI0_MASK) >> USBHS_USBSTS_TI0_SHIFT)
#define USBHS_BRD_USBSTS_TI0(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_TI0_SHIFT))

