RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the AAE field to a new value. */
#define USBHS_WR_USBINTR_AAE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_AAE_MASK, USBHS_USBINTR_AAE(value)))
#define USBHS_BWR_USBINTR_AAE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_AAE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field URE[6] (RW)
 *
 * A non-EHCI bit. When this bit and the USBSTS[URI] bit are set, device
 * controller issues an interrupt. Software clearing the USBSTS[URI] bit acknowledges
 * the interrupt. Used only in device mode.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_URE field. */
#define USBHS_RD_USBINTR_URE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_URE_MASK) >> USBHS_USBINTR_URE_SHIFT)
#define USBHS_BRD_USBINTR_URE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_URE_SHIFT))

/*! @brief Set the URE field to a new value. */
#define USBHS_WR_USBINTR_URE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_URE_MASK, USBHS_USBINTR_URE(value)))
#define USBHS_BWR_USBINTR_URE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_URE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field SRE[7] (RW)
 *
 * This is a non-EHCI bit. When this bit and the USBSTS[SRI] bit are set,
 * controller issues an interrupt. Software clearing the USBSTS[SRI] bit acknowledges
 * the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_SRE field. */
#define USBHS_RD_USBINTR_SRE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_SRE_MASK) >> USBHS_USBINTR_SRE_SHIFT)
#define USBHS_BRD_USBINTR_SRE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SRE_SHIFT))

/*! @brief Set the SRE field to a new value. */
#define USBHS_WR_USBINTR_SRE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_SRE_MASK, USBHS_USBINTR_SRE(value)))
#define USBHS_BWR_USBINTR_SRE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field SLE[8] (RW)
 *
 * A non-EHCI bit. When this bit is set and the USBSTS[SLI] bit transitions,
 * USBHS controller issues an interrupt. Software writing a 1 to the USBSTS[SLI] bit
 * acknowledges the interrupt. Used only in device mode.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_SLE field. */
#define USBHS_RD_USBINTR_SLE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_SLE_MASK) >> USBHS_USBINTR_SLE_SHIFT)
#define USBHS_BRD_USBINTR_SLE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SLE_SHIFT))

/*! @brief Set the SLE field to a new value. */
#define USBHS_WR_USBINTR_SLE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_SLE_MASK, USBHS_USBINTR_SLE(value)))
#define USBHS_BWR_USBINTR_SLE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SLE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field NAKE[16] (RW)
 *
 * When this bit and the USBSTS[NAKI] bit are set, an interrupt generates.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_NAKE field. */
#define USBHS_RD_USBINTR_NAKE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_NAKE_MASK) >> USBHS_USBINTR_NAKE_SHIFT)
#define USBHS_BRD_USBINTR_NAKE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_NAKE_SHIFT))

/*! @brief Set the NAKE field to a new value. */
#define USBHS_WR_USBINTR_NAKE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_NAKE_MASK, USBHS_USBINTR_NAKE(value)))
#define USBHS_BWR_USBINTR_NAKE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_NAKE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field UAIE[18] (RW)
 *
 * When this bit and USBSTS[USBHSTASYNCINT] are set, the host controller issues
 * an interrupt at the next interrupt threshold. The interrupt is acknowledged by
 * clearing USBHSTASYNCINT.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_UAIE field. */
#define USBHS_RD_USBINTR_UAIE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_UAIE_MASK) >> USBHS_USBINTR_UAIE_SHIFT)
#define USBHS_BRD_USBINTR_UAIE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UAIE_SHIFT))

/*! @brief Set the UAIE field to a new value. */
#define USBHS_WR_USBINTR_UAIE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_UAIE_MASK, USBHS_USBINTR_UAIE(value)))
#define USBHS_BWR_USBINTR_UAIE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UAIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field UPIE[19] (RW)
 *
 * When this bit and USBSTS[USBHSTPERINT] are set, the host controller issues an
 * interrupt at the next interrupt threshold. The interrupt is acknowledged by
 * clearing USBHSTPERINT.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_UPIE field. */
#define USBHS_RD_USBINTR_UPIE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_UPIE_MASK) >> USBHS_USBINTR_UPIE_SHIFT)
#define USBHS_BRD_USBINTR_UPIE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UPIE_SHIFT))

/*! @brief Set the UPIE field to a new value. */
#define USBHS_WR_USBINTR_UPIE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_UPIE_MASK, USBHS_USBINTR_UPIE(value)))
#define USBHS_BWR_USBINTR_UPIE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UPIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field TIE0[24] (RW)
 *
 * When this bit and USBSTS[GPTINT0] are set, the USB controller issues an
 * interrupt to the processor. The interrupt is acknowledged by clearing GPTINT0.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_TIE0 field. */
#define USBHS_RD_USBINTR_TIE0(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_TIE0_MASK) >> USBHS_USBINTR_TIE0_SHIFT)
#define USBHS_BRD_USBINTR_TIE0(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_TIE0_SHIFT))

