RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*
 * Constants & macros for individual USBHS_EPFLUSH bitfields
 */

/*!
 * @name Register USBHS_EPFLUSH, field FERB[3:0] (RW)
 *
 * Writing a 1 to a bit in this field causes the associated endpoint to clear
 * any primed buffers. If a packet is in progress for an associated endpoint, that
 * transfer continues until completion. Hardware clears this register after the
 * endpoint flush operation is successful. FERB[3] corresponds to endpoint 3.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPFLUSH_FERB field. */
#define USBHS_RD_EPFLUSH_FERB(base) ((USBHS_EPFLUSH_REG(base) & USBHS_EPFLUSH_FERB_MASK) >> USBHS_EPFLUSH_FERB_SHIFT)
#define USBHS_BRD_EPFLUSH_FERB(base) (USBHS_RD_EPFLUSH_FERB(base))

/*! @brief Set the FERB field to a new value. */
#define USBHS_WR_EPFLUSH_FERB(base, value) (USBHS_RMW_EPFLUSH(base, USBHS_EPFLUSH_FERB_MASK, USBHS_EPFLUSH_FERB(value)))
#define USBHS_BWR_EPFLUSH_FERB(base, value) (USBHS_WR_EPFLUSH_FERB(base, value))
/*@}*/

/*!
 * @name Register USBHS_EPFLUSH, field FETB[19:16] (RW)
 *
 * Writing a 1 to a bit in this field causes the associated endpoint to clear
 * any primed buffers. If a packet is in progress for an associated endpoint, that
 * transfer continues until completion. Hardware clears this register after the
 * endpoint flush operation is successful.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPFLUSH_FETB field. */
#define USBHS_RD_EPFLUSH_FETB(base) ((USBHS_EPFLUSH_REG(base) & USBHS_EPFLUSH_FETB_MASK) >> USBHS_EPFLUSH_FETB_SHIFT)
#define USBHS_BRD_EPFLUSH_FETB(base) (USBHS_RD_EPFLUSH_FETB(base))

/*! @brief Set the FETB field to a new value. */
#define USBHS_WR_EPFLUSH_FETB(base, value) (USBHS_RMW_EPFLUSH(base, USBHS_EPFLUSH_FETB_MASK, USBHS_EPFLUSH_FETB(value)))
#define USBHS_BWR_EPFLUSH_FETB(base, value) (USBHS_WR_EPFLUSH_FETB(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_EPSR - Endpoint Status Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPSR - Endpoint Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is only
 * used in device mode.
 */
/*!
 * @name Constants and macros for entire USBHS_EPSR register
 */
/*@{*/
#define USBHS_RD_EPSR(base)      (USBHS_EPSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPSR bitfields
 */

/*!
 * @name Register USBHS_EPSR, field ERBR[3:0] (RO)
 *
 * One bit for each endpoint indicates status of the respective endpoint buffer.
 * The hardware sets this bit in response to receiving a command from a
 * corresponding bit in the EPPRIME register. A constant delay exists between setting a
 * bit in the EPPRIME register and endpoint indicating ready. This delay time
 * varies based upon the current USB traffic and the number of bits set in the
 * EPPRIME register. USB reset, USB DMA system, or EPFLUSH register clears the buffer
 * ready. ERBR[3] (bit 19) corresponds to endpoint 3. Hardware momentarily clears
 * these bits during hardware endpoint re-priming operations when a dTD is
 * retired, and the dQH is updated.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPSR_ERBR field. */
#define USBHS_RD_EPSR_ERBR(base) ((USBHS_EPSR_REG(base) & USBHS_EPSR_ERBR_MASK) >> USBHS_EPSR_ERBR_SHIFT)
#define USBHS_BRD_EPSR_ERBR(base) (USBHS_RD_EPSR_ERBR(base))
/*@}*/

/*!
 * @name Register USBHS_EPSR, field ETBR[19:16] (RO)
 *
 * One bit for each endpoint indicates status of the respective endpoint buffer.
 * The hardware sets this bit in response to receiving a command from a
 * corresponding bit in the EPPRIME register. A constant delay exists between setting a
 * bit in the EPPRIME register and endpoint indicating ready. This delay time
 * varies based upon the current USB traffic and the number of bits set in the
 * EPPRIME register. USB reset, USB DMA system, or EPFLUSH register clears the buffer
 * ready. ETBR[3] (bit 19) corresponds to endpoint 3. Hardware momentarily clears
 * these bits during hardware endpoint re-priming operations when a dTD is
 * retired, and the dQH is updated.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPSR_ETBR field. */
#define USBHS_RD_EPSR_ETBR(base) ((USBHS_EPSR_REG(base) & USBHS_EPSR_ETBR_MASK) >> USBHS_EPSR_ETBR_SHIFT)
#define USBHS_BRD_EPSR_ETBR(base) (USBHS_RD_EPSR_ETBR(base))
/*@}*/

/*******************************************************************************
 * USBHS_EPCOMPLETE - Endpoint Complete Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPCOMPLETE - Endpoint Complete Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is used
 * only in device mode.
 */
/*!
 * @name Constants and macros for entire USBHS_EPCOMPLETE register
 */
/*@{*/
#define USBHS_RD_EPCOMPLETE(base) (USBHS_EPCOMPLETE_REG(base))
#define USBHS_WR_EPCOMPLETE(base, value) (USBHS_EPCOMPLETE_REG(base) = (value))
#define USBHS_RMW_EPCOMPLETE(base, mask, value) (USBHS_WR_EPCOMPLETE(base, (USBHS_RD_EPCOMPLETE(base) & ~(mask)) | (value)))
#define USBHS_SET_EPCOMPLETE(base, value) (USBHS_WR_EPCOMPLETE(base, USBHS_RD_EPCOMPLETE(base) |  (value)))
#define USBHS_CLR_EPCOMPLETE(base, value) (USBHS_WR_EPCOMPLETE(base, USBHS_RD_EPCOMPLETE(base) & ~(value)))
#define USBHS_TOG_EPCOMPLETE(base, value) (USBHS_WR_EPCOMPLETE(base, USBHS_RD_EPCOMPLETE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPCOMPLETE bitfields
 */

/*!
 * @name Register USBHS_EPCOMPLETE, field ERCE[3:0] (W1C)
 *
 * Each bit indicates a received event (OUT/SETUP) occurs and software must read
 * the corresponding endpoint queue to determine the transfer status. If the
 * corresponding IOC bit is set in the transfer descriptor, this bit is set
 * simultaneously with the USBINT. Writing a 1 clears the corresponding bit in this
 * register. ERCE[3] corresponds to endpoint 3.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCOMPLETE_ERCE field. */
#define USBHS_RD_EPCOMPLETE_ERCE(base) ((USBHS_EPCOMPLETE_REG(base) & USBHS_EPCOMPLETE_ERCE_MASK) >> USBHS_EPCOMPLETE_ERCE_SHIFT)
#define USBHS_BRD_EPCOMPLETE_ERCE(base) (USBHS_RD_EPCOMPLETE_ERCE(base))

/*! @brief Set the ERCE field to a new value. */
#define USBHS_WR_EPCOMPLETE_ERCE(base, value) (USBHS_RMW_EPCOMPLETE(base, (USBHS_EPCOMPLETE_ERCE_MASK | USBHS_EPCOMPLETE_ETCE_MASK), USBHS_EPCOMPLETE_ERCE(value)))
#define USBHS_BWR_EPCOMPLETE_ERCE(base, value) (USBHS_WR_EPCOMPLETE_ERCE(base, value))
/*@}*/

/*!
 * @name Register USBHS_EPCOMPLETE, field ETCE[19:16] (W1C)
 *
 * Each bit indicates a transmit event (IN/INTERRUPT) occurs and software must
 * read the corresponding endpoint queue to determine the endpoint status. If the
 * corresponding IOC bit is set in the transfer descriptor, this bit is set
 * simultaneously with the USBINT. Writing a 1 clears the corresponding bit in this
 * register. ETCE[3] (bit 19) corresponds to endpoint 3.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCOMPLETE_ETCE field. */
#define USBHS_RD_EPCOMPLETE_ETCE(base) ((USBHS_EPCOMPLETE_REG(base) & USBHS_EPCOMPLETE_ETCE_MASK) >> USBHS_EPCOMPLETE_ETCE_SHIFT)
#define USBHS_BRD_EPCOMPLETE_ETCE(base) (USBHS_RD_EPCOMPLETE_ETCE(base))

