RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the ETCE field to a new value. */
#define USBHS_WR_EPCOMPLETE_ETCE(base, value) (USBHS_RMW_EPCOMPLETE(base, (USBHS_EPCOMPLETE_ETCE_MASK | USBHS_EPCOMPLETE_ERCE_MASK), USBHS_EPCOMPLETE_ETCE(value)))
#define USBHS_BWR_EPCOMPLETE_ETCE(base, value) (USBHS_WR_EPCOMPLETE_ETCE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_EPCR0 - Endpoint Control Register 0
 ******************************************************************************/

/*!
 * @brief USBHS_EPCR0 - Endpoint Control Register 0 (RW)
 *
 * Reset value: 0x00800080U
 *
 * This register is not defined in the EHCI specification. Every device
 * implements endpoint 0 as a control endpoint.
 */
/*!
 * @name Constants and macros for entire USBHS_EPCR0 register
 */
/*@{*/
#define USBHS_RD_EPCR0(base)     (USBHS_EPCR0_REG(base))
#define USBHS_WR_EPCR0(base, value) (USBHS_EPCR0_REG(base) = (value))
#define USBHS_RMW_EPCR0(base, mask, value) (USBHS_WR_EPCR0(base, (USBHS_RD_EPCR0(base) & ~(mask)) | (value)))
#define USBHS_SET_EPCR0(base, value) (USBHS_WR_EPCR0(base, USBHS_RD_EPCR0(base) |  (value)))
#define USBHS_CLR_EPCR0(base, value) (USBHS_WR_EPCR0(base, USBHS_RD_EPCR0(base) & ~(value)))
#define USBHS_TOG_EPCR0(base, value) (USBHS_WR_EPCR0(base, USBHS_RD_EPCR0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPCR0 bitfields
 */

/*!
 * @name Register USBHS_EPCR0, field RXS[0] (RW)
 *
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears the
 * bit or it automatically clears upon receipt of a new SETUP request.
 *
 * Values:
 * - 0b0 - Endpoint OK
 * - 0b1 - Endpoint stalled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_RXS field. */
#define USBHS_RD_EPCR0_RXS(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_RXS_MASK) >> USBHS_EPCR0_RXS_SHIFT)
#define USBHS_BRD_EPCR0_RXS(base) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_RXS_SHIFT))

/*! @brief Set the RXS field to a new value. */
#define USBHS_WR_EPCR0_RXS(base, value) (USBHS_RMW_EPCR0(base, USBHS_EPCR0_RXS_MASK, USBHS_EPCR0_RXS(value)))
#define USBHS_BWR_EPCR0_RXS(base, value) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_RXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR0, field RXT[3:2] (RO)
 *
 * Endpoint zero is always a control endpoint.
 *
 * Values:
 * - 0b00 - Control
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_RXT field. */
#define USBHS_RD_EPCR0_RXT(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_RXT_MASK) >> USBHS_EPCR0_RXT_SHIFT)
#define USBHS_BRD_EPCR0_RXT(base) (USBHS_RD_EPCR0_RXT(base))
/*@}*/

/*!
 * @name Register USBHS_EPCR0, field RXE[7] (RO)
 *
 * Endpoint zero is always enabled.
 *
 * Values:
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_RXE field. */
#define USBHS_RD_EPCR0_RXE(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_RXE_MASK) >> USBHS_EPCR0_RXE_SHIFT)
#define USBHS_BRD_EPCR0_RXE(base) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_RXE_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_EPCR0, field TXS[16] (RW)
 *
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears the
 * bit or it automatically clears upon receipt of a new SETUP request.
 *
 * Values:
 * - 0b0 - Endpoint OK
 * - 0b1 - Endpoint stalled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_TXS field. */
#define USBHS_RD_EPCR0_TXS(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_TXS_MASK) >> USBHS_EPCR0_TXS_SHIFT)
#define USBHS_BRD_EPCR0_TXS(base) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_TXS_SHIFT))

/*! @brief Set the TXS field to a new value. */
#define USBHS_WR_EPCR0_TXS(base, value) (USBHS_RMW_EPCR0(base, USBHS_EPCR0_TXS_MASK, USBHS_EPCR0_TXS(value)))
#define USBHS_BWR_EPCR0_TXS(base, value) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_TXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR0, field TXT[19:18] (RO)
 *
 * Endpoint zero is always a control endpoint.
 *
 * Values:
 * - 0b00 - Control
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_TXT field. */
#define USBHS_RD_EPCR0_TXT(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_TXT_MASK) >> USBHS_EPCR0_TXT_SHIFT)
#define USBHS_BRD_EPCR0_TXT(base) (USBHS_RD_EPCR0_TXT(base))
/*@}*/

/*!
 * @name Register USBHS_EPCR0, field TXE[23] (RO)
 *
 * Endpoint zero is always enabled.
 *
 * Values:
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR0_TXE field. */
#define USBHS_RD_EPCR0_TXE(base) ((USBHS_EPCR0_REG(base) & USBHS_EPCR0_TXE_MASK) >> USBHS_EPCR0_TXE_SHIFT)
#define USBHS_BRD_EPCR0_TXE(base) (BITBAND_ACCESS32(&USBHS_EPCR0_REG(base), USBHS_EPCR0_TXE_SHIFT))
/*@}*/

/*******************************************************************************
 * USBHS_EPCR - Endpoint Control Register n
 ******************************************************************************/

/*!
 * @brief USBHS_EPCR - Endpoint Control Register n (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers are not defined in the EHCI specification. There is an EPCRn
 * register for each endpoint in a device.
 */
/*!
 * @name Constants and macros for entire USBHS_EPCR register
 */
/*@{*/
#define USBHS_RD_EPCR(base, index) (USBHS_EPCR_REG(base, index))
#define USBHS_WR_EPCR(base, index, value) (USBHS_EPCR_REG(base, index) = (value))
#define USBHS_RMW_EPCR(base, index, mask, value) (USBHS_WR_EPCR(base, index, (USBHS_RD_EPCR(base, index) & ~(mask)) | (value)))
#define USBHS_SET_EPCR(base, index, value) (USBHS_WR_EPCR(base, index, USBHS_RD_EPCR(base, index) |  (value)))
#define USBHS_CLR_EPCR(base, index, value) (USBHS_WR_EPCR(base, index, USBHS_RD_EPCR(base, index) & ~(value)))
#define USBHS_TOG_EPCR(base, index, value) (USBHS_WR_EPCR(base, index, USBHS_RD_EPCR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPCR bitfields
 */

/*!
 * @name Register USBHS_EPCR, field RXS[0] (RW)
 *
 * This bit sets automatically upon receipt of a SETUP request if this endpoint
 * is not configured as a control endpoint. It clears automatically upon receipt
 * of a SETUP request if this endpoint is configured as a control endpoint.
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears this bit or
 * automatically clears as above.
 *
 * Values:
 * - 0b0 - Endpoint OK
 * - 0b1 - Endpoint stalled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXS field. */
#define USBHS_RD_EPCR_RXS(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXS_MASK) >> USBHS_EPCR_RXS_SHIFT)
#define USBHS_BRD_EPCR_RXS(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXS_SHIFT))

