RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the RXS field to a new value. */
#define USBHS_WR_EPCR_RXS(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXS_MASK, USBHS_EPCR_RXS(value)))
#define USBHS_BWR_EPCR_RXS(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXD[1] (RW)
 *
 * This bit should always be written as 0, which selects the dual port
 * memory/DMA engine as the sink.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXD field. */
#define USBHS_RD_EPCR_RXD(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXD_MASK) >> USBHS_EPCR_RXD_SHIFT)
#define USBHS_BRD_EPCR_RXD(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXD_SHIFT))

/*! @brief Set the RXD field to a new value. */
#define USBHS_WR_EPCR_RXD(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXD_MASK, USBHS_EPCR_RXD(value)))
#define USBHS_BWR_EPCR_RXD(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXT[3:2] (RW)
 *
 * When only one endpoint (RX or TX, but not both) of an endpoint pair is used,
 * the unused endpoint should be configured as a bulk type endpoint.
 *
 * Values:
 * - 0b00 - Control
 * - 0b01 - Isochronous
 * - 0b10 - Bulk
 * - 0b11 - Interrupt
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXT field. */
#define USBHS_RD_EPCR_RXT(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXT_MASK) >> USBHS_EPCR_RXT_SHIFT)
#define USBHS_BRD_EPCR_RXT(base, index) (USBHS_RD_EPCR_RXT(base, index))

/*! @brief Set the RXT field to a new value. */
#define USBHS_WR_EPCR_RXT(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXT_MASK, USBHS_EPCR_RXT(value)))
#define USBHS_BWR_EPCR_RXT(base, index, value) (USBHS_WR_EPCR_RXT(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXI[5] (RW)
 *
 * This bit is only for testing and should always be written as 0. Writing a 1
 * to this bit causes this endpoint to ignore the data toggle sequence and always
 * accept data packets regardless of their data PID.
 *
 * Values:
 * - 0b0 - PID sequencing enabled
 * - 0b1 - PID sequencing disabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXI field. */
#define USBHS_RD_EPCR_RXI(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXI_MASK) >> USBHS_EPCR_RXI_SHIFT)
#define USBHS_BRD_EPCR_RXI(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXI_SHIFT))

/*! @brief Set the RXI field to a new value. */
#define USBHS_WR_EPCR_RXI(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXI_MASK, USBHS_EPCR_RXI(value)))
#define USBHS_BWR_EPCR_RXI(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXR[6] (WO)
 *
 * When a configuration event is received for this endpoint, software must write
 * a 1 to this bit to synchronize the data PIDs between the host and device.
 * This bit is self-clearing.
 */
/*@{*/
/*! @brief Set the RXR field to a new value. */
#define USBHS_WR_EPCR_RXR(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXR_MASK, USBHS_EPCR_RXR(value)))
#define USBHS_BWR_EPCR_RXR(base, index, value) (USBHS_WR_EPCR_RXR(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXE[7] (RW)
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXE field. */
#define USBHS_RD_EPCR_RXE(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXE_MASK) >> USBHS_EPCR_RXE_SHIFT)
#define USBHS_BRD_EPCR_RXE(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXE_SHIFT))

/*! @brief Set the RXE field to a new value. */
#define USBHS_WR_EPCR_RXE(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXE_MASK, USBHS_EPCR_RXE(value)))
#define USBHS_BWR_EPCR_RXE(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXS[16] (RW)
 *
 * This bit sets automatically upon receipt of a SETUP request if this endpoint
 * is not configured as a control endpoint. It clears automatically upon receipt
 * of a SETUP request if this endpoint is configured as a control endpoint.
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears this bit
 * clears or automatically clears as above.
 *
 * Values:
 * - 0b0 - Endpoint OK
 * - 0b1 - Endpoint stalled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXS field. */
#define USBHS_RD_EPCR_TXS(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXS_MASK) >> USBHS_EPCR_TXS_SHIFT)
#define USBHS_BRD_EPCR_TXS(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXS_SHIFT))

/*! @brief Set the TXS field to a new value. */
#define USBHS_WR_EPCR_TXS(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXS_MASK, USBHS_EPCR_TXS(value)))
#define USBHS_BWR_EPCR_TXS(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXD[17] (RW)
 *
 * This bit should always be written as 0, which selects the dual port
 * memory/DMA engine as the source.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXD field. */
#define USBHS_RD_EPCR_TXD(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXD_MASK) >> USBHS_EPCR_TXD_SHIFT)
#define USBHS_BRD_EPCR_TXD(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXD_SHIFT))

/*! @brief Set the TXD field to a new value. */
#define USBHS_WR_EPCR_TXD(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXD_MASK, USBHS_EPCR_TXD(value)))
#define USBHS_BWR_EPCR_TXD(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXT[19:18] (RW)
 *
 * When only one endpoint (RX or TX, but not both) of an endpoint pair is used,
 * the unused endpoint should be configured as a bulk type endpoint.
 *
 * Values:
 * - 0b00 - Control
 * - 0b01 - Isochronous
 * - 0b10 - Bulk
 * - 0b11 - Interrupt
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXT field. */
#define USBHS_RD_EPCR_TXT(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXT_MASK) >> USBHS_EPCR_TXT_SHIFT)
#define USBHS_BRD_EPCR_TXT(base, index) (USBHS_RD_EPCR_TXT(base, index))

