RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the CLOCK_SPEED field to a new value. */
#define USBHSDCD_WR_CLOCK_CLOCK_SPEED(base, value) (USBHSDCD_RMW_CLOCK(base, USBHSDCD_CLOCK_CLOCK_SPEED_MASK, USBHSDCD_CLOCK_CLOCK_SPEED(value)))
#define USBHSDCD_BWR_CLOCK_CLOCK_SPEED(base, value) (USBHSDCD_WR_CLOCK_CLOCK_SPEED(base, value))
/*@}*/

/*******************************************************************************
 * USBHSDCD_STATUS - Status register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_STATUS - Status register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Provides the current state of the module for system software monitoring.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_STATUS register
 */
/*@{*/
#define USBHSDCD_RD_STATUS(base) (USBHSDCD_STATUS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_STATUS bitfields
 */

/*!
 * @name Register USBHSDCD_STATUS, field SEQ_RES[17:16] (RO)
 *
 * Reports how the charger detection is attached.
 *
 * Values:
 * - 0b00 - No results to report.
 * - 0b01 - Attached to an SDP. Must comply with USB 2.0 by drawing only 2.5 mA
 *     (max) until connected.
 * - 0b10 - Attached to a charging port. The exact meaning depends on bit 18: 0:
 *     Attached to either a CDP or a DCP. The charger type detection has not
 *     completed. 1: Attached to a CDP. The charger type detection has completed.
 * - 0b11 - Attached to a DCP.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_STATUS_SEQ_RES field. */
#define USBHSDCD_RD_STATUS_SEQ_RES(base) ((USBHSDCD_STATUS_REG(base) & USBHSDCD_STATUS_SEQ_RES_MASK) >> USBHSDCD_STATUS_SEQ_RES_SHIFT)
#define USBHSDCD_BRD_STATUS_SEQ_RES(base) (USBHSDCD_RD_STATUS_SEQ_RES(base))
/*@}*/

/*!
 * @name Register USBHSDCD_STATUS, field SEQ_STAT[19:18] (RO)
 *
 * Indicates the status of the charger detection sequence.
 *
 * Values:
 * - 0b00 - The module is either not enabled, or the module is enabled but the
 *     data pins have not yet been detected.
 * - 0b01 - Data pin contact detection is complete.
 * - 0b10 - Charging port detection is complete.
 * - 0b11 - Charger type detection is complete.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_STATUS_SEQ_STAT field. */
#define USBHSDCD_RD_STATUS_SEQ_STAT(base) ((USBHSDCD_STATUS_REG(base) & USBHSDCD_STATUS_SEQ_STAT_MASK) >> USBHSDCD_STATUS_SEQ_STAT_SHIFT)
#define USBHSDCD_BRD_STATUS_SEQ_STAT(base) (USBHSDCD_RD_STATUS_SEQ_STAT(base))
/*@}*/

/*!
 * @name Register USBHSDCD_STATUS, field ERR[20] (RO)
 *
 * Indicates whether there is an error in the detection sequence.
 *
 * Values:
 * - 0b0 - No sequence errors.
 * - 0b1 - Error in the detection sequence. See the SEQ_STAT field to determine
 *     the phase in which the error occurred.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_STATUS_ERR field. */
#define USBHSDCD_RD_STATUS_ERR(base) ((USBHSDCD_STATUS_REG(base) & USBHSDCD_STATUS_ERR_MASK) >> USBHSDCD_STATUS_ERR_SHIFT)
#define USBHSDCD_BRD_STATUS_ERR(base) (BITBAND_ACCESS32(&USBHSDCD_STATUS_REG(base), USBHSDCD_STATUS_ERR_SHIFT))
/*@}*/

/*!
 * @name Register USBHSDCD_STATUS, field TO[21] (RO)
 *
 * Indicates whether the detection sequence has passed the timeout threshhold.
 *
 * Values:
 * - 0b0 - The detection sequence has not been running for over 1 s.
 * - 0b1 - It has been over 1 s since the data pin contact was detected and
 *     debounced.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_STATUS_TO field. */
#define USBHSDCD_RD_STATUS_TO(base) ((USBHSDCD_STATUS_REG(base) & USBHSDCD_STATUS_TO_MASK) >> USBHSDCD_STATUS_TO_SHIFT)
#define USBHSDCD_BRD_STATUS_TO(base) (BITBAND_ACCESS32(&USBHSDCD_STATUS_REG(base), USBHSDCD_STATUS_TO_SHIFT))
/*@}*/

/*!
 * @name Register USBHSDCD_STATUS, field ACTIVE[22] (RO)
 *
 * Indicates whether the sequence is running.
 *
 * Values:
 * - 0b0 - The sequence is not running.
 * - 0b1 - The sequence is running.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_STATUS_ACTIVE field. */
#define USBHSDCD_RD_STATUS_ACTIVE(base) ((USBHSDCD_STATUS_REG(base) & USBHSDCD_STATUS_ACTIVE_MASK) >> USBHSDCD_STATUS_ACTIVE_SHIFT)
#define USBHSDCD_BRD_STATUS_ACTIVE(base) (BITBAND_ACCESS32(&USBHSDCD_STATUS_REG(base), USBHSDCD_STATUS_ACTIVE_SHIFT))
/*@}*/

/*******************************************************************************
 * USBHSDCD_SIGNAL_OVERRIDE - Signal Override Register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_SIGNAL_OVERRIDE - Signal Override Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Signal Override register provides a way for the customer to enable
 * signaling required by the USB BC v1.2 specification after the battery charger
 * detection sequences have completed.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_SIGNAL_OVERRIDE register
 */
/*@{*/
#define USBHSDCD_RD_SIGNAL_OVERRIDE(base) (USBHSDCD_SIGNAL_OVERRIDE_REG(base))
#define USBHSDCD_WR_SIGNAL_OVERRIDE(base, value) (USBHSDCD_SIGNAL_OVERRIDE_REG(base) = (value))
#define USBHSDCD_RMW_SIGNAL_OVERRIDE(base, mask, value) (USBHSDCD_WR_SIGNAL_OVERRIDE(base, (USBHSDCD_RD_SIGNAL_OVERRIDE(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_SIGNAL_OVERRIDE(base, value) (USBHSDCD_WR_SIGNAL_OVERRIDE(base, USBHSDCD_RD_SIGNAL_OVERRIDE(base) |  (value)))
#define USBHSDCD_CLR_SIGNAL_OVERRIDE(base, value) (USBHSDCD_WR_SIGNAL_OVERRIDE(base, USBHSDCD_RD_SIGNAL_OVERRIDE(base) & ~(value)))
#define USBHSDCD_TOG_SIGNAL_OVERRIDE(base, value) (USBHSDCD_WR_SIGNAL_OVERRIDE(base, USBHSDCD_RD_SIGNAL_OVERRIDE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_SIGNAL_OVERRIDE bitfields
 */

/*!
 * @name Register USBHSDCD_SIGNAL_OVERRIDE, field PS[1:0] (RW)
 *
 * Used to enable specified voltage and current source circuits on the USB_DP
 * and USB_DM pins. Customers may set this bit field to 2'b10 for required
 * signaling if attached to a Dedicated Charging Port, or during operation under the Dead
 * Battery Provision.
 *
 * Values:
 * - 0b00 - No overrides. Bit field must remain at this value during normal USB
 *     data communication to prevent unexpected conditions on USB_DP and USB_DM
 *     pins. (Default)
 * - 0b01 - Reserved, not for customer use.
 * - 0b10 - Enables VDP_SRC voltage source for the USB_DP pin and IDM_SINK
 *     current source for the USB_DM pin.
 * - 0b11 - Reserved, not for customer use.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_SIGNAL_OVERRIDE_PS field. */
#define USBHSDCD_RD_SIGNAL_OVERRIDE_PS(base) ((USBHSDCD_SIGNAL_OVERRIDE_REG(base) & USBHSDCD_SIGNAL_OVERRIDE_PS_MASK) >> USBHSDCD_SIGNAL_OVERRIDE_PS_SHIFT)
#define USBHSDCD_BRD_SIGNAL_OVERRIDE_PS(base) (USBHSDCD_RD_SIGNAL_OVERRIDE_PS(base))

/*! @brief Set the PS field to a new value. */
#define USBHSDCD_WR_SIGNAL_OVERRIDE_PS(base, value) (USBHSDCD_RMW_SIGNAL_OVERRIDE(base, USBHSDCD_SIGNAL_OVERRIDE_PS_MASK, USBHSDCD_SIGNAL_OVERRIDE_PS(value)))
#define USBHSDCD_BWR_SIGNAL_OVERRIDE_PS(base, value) (USBHSDCD_WR_SIGNAL_OVERRIDE_PS(base, value))
/*@}*/

