RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the ENUTMILEVEL3 field to a new value. */
#define USBPHY_WR_CTRL_ENUTMILEVEL3(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENUTMILEVEL3_MASK, USBPHY_CTRL_ENUTMILEVEL3(value)))
#define USBPHY_BWR_CTRL_ENUTMILEVEL3(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENUTMILEVEL3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field AUTORESUME_EN[18] (RW)
 *
 * Enable the auto resume feature, when set, HW will use 32KHz clock to send
 * Resume to respond to the device remote wakeup(for host mode only). It's useful
 * when PLL is off and reference clock is also powered down.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_AUTORESUME_EN field. */
#define USBPHY_RD_CTRL_AUTORESUME_EN(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_AUTORESUME_EN_MASK) >> USBPHY_CTRL_AUTORESUME_EN_SHIFT)
#define USBPHY_BRD_CTRL_AUTORESUME_EN(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_AUTORESUME_EN_SHIFT))

/*! @brief Set the AUTORESUME_EN field to a new value. */
#define USBPHY_WR_CTRL_AUTORESUME_EN(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_AUTORESUME_EN_MASK, USBPHY_CTRL_AUTORESUME_EN(value)))
#define USBPHY_BWR_CTRL_AUTORESUME_EN(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_AUTORESUME_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field ENAUTOCLR_CLKGATE[19] (RW)
 *
 * Enables the feature to auto-clear the CLKGATE bit if there is wakeup event
 * while USB is suspended. This should be enabled if needed to support auto wakeup
 * without software interaction.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENAUTOCLR_CLKGATE field. */
#define USBPHY_RD_CTRL_ENAUTOCLR_CLKGATE(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK) >> USBPHY_CTRL_ENAUTOCLR_CLKGATE_SHIFT)
#define USBPHY_BRD_CTRL_ENAUTOCLR_CLKGATE(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENAUTOCLR_CLKGATE_SHIFT))

/*! @brief Set the ENAUTOCLR_CLKGATE field to a new value. */
#define USBPHY_WR_CTRL_ENAUTOCLR_CLKGATE(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK, USBPHY_CTRL_ENAUTOCLR_CLKGATE(value)))
#define USBPHY_BWR_CTRL_ENAUTOCLR_CLKGATE(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENAUTOCLR_CLKGATE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field ENAUTOCLR_PHY_PWD[20] (RW)
 *
 * Enables the feature to auto-clear the PWD register bits in USBPHY_PWD if
 * there is wakeup event while USB is suspended. This should be enabled if needed to
 * support auto wakeup without software interaction.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENAUTOCLR_PHY_PWD field. */
#define USBPHY_RD_CTRL_ENAUTOCLR_PHY_PWD(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK) >> USBPHY_CTRL_ENAUTOCLR_PHY_PWD_SHIFT)
#define USBPHY_BRD_CTRL_ENAUTOCLR_PHY_PWD(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENAUTOCLR_PHY_PWD_SHIFT))

/*! @brief Set the ENAUTOCLR_PHY_PWD field to a new value. */
#define USBPHY_WR_CTRL_ENAUTOCLR_PHY_PWD(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK, USBPHY_CTRL_ENAUTOCLR_PHY_PWD(value)))
#define USBPHY_BWR_CTRL_ENAUTOCLR_PHY_PWD(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENAUTOCLR_PHY_PWD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field FSDLL_RST_EN[24] (RW)
 *
 * Enables the feature to reset the FSDLL lock detection logic at the end of
 * each TX packet.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_FSDLL_RST_EN field. */
#define USBPHY_RD_CTRL_FSDLL_RST_EN(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_FSDLL_RST_EN_MASK) >> USBPHY_CTRL_FSDLL_RST_EN_SHIFT)
#define USBPHY_BRD_CTRL_FSDLL_RST_EN(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_FSDLL_RST_EN_SHIFT))

/*! @brief Set the FSDLL_RST_EN field to a new value. */
#define USBPHY_WR_CTRL_FSDLL_RST_EN(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_FSDLL_RST_EN_MASK, USBPHY_CTRL_FSDLL_RST_EN(value)))
#define USBPHY_BWR_CTRL_FSDLL_RST_EN(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_FSDLL_RST_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field OTG_ID_VALUE[27] (RO)
 *
 * Indicates the results of USB_ID pin while monitoring the cable plugged into
 * the Micro- or Mini-AB receptacle. False (0) is when ID resistance is less than
 * Ra_Plug_ID, indicating host (A) side. True (1) is when ID resistance is
 * greater than Rb_Plug_ID, indicating device (B) side. Similar to the function of the
 * OTGID_STATUS bit in the USBPHY_STATUS register, but OTG_ID_VALUE has debounce
 * and system clock synchronization logic to filter the glitches on the USB_ID
 * pad.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_OTG_ID_VALUE field. */
#define USBPHY_RD_CTRL_OTG_ID_VALUE(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_OTG_ID_VALUE_MASK) >> USBPHY_CTRL_OTG_ID_VALUE_SHIFT)
#define USBPHY_BRD_CTRL_OTG_ID_VALUE(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_OTG_ID_VALUE_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field HOST_FORCE_LS_SE0[28] (RW)
 *
 * Forces the next FS packet that is transmitted to have a EOP with low-speed
 * timing. This bit is used in host mode for the resume sequence. After the packet
 * is transferred, this bit is cleared. The design can use this function to force
 * the LS SE0 or use the USBPHY_CTRL_UTMI_SUSPENDM to trigger this event when
 * leaving suspend. This bit is used in conjunction with
 * USBPHY_DEBUG_HOST_RESUME_DEBUG.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_HOST_FORCE_LS_SE0 field. */
#define USBPHY_RD_CTRL_HOST_FORCE_LS_SE0(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_HOST_FORCE_LS_SE0_MASK) >> USBPHY_CTRL_HOST_FORCE_LS_SE0_SHIFT)
#define USBPHY_BRD_CTRL_HOST_FORCE_LS_SE0(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_HOST_FORCE_LS_SE0_SHIFT))

/*! @brief Set the HOST_FORCE_LS_SE0 field to a new value. */
#define USBPHY_WR_CTRL_HOST_FORCE_LS_SE0(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_HOST_FORCE_LS_SE0_MASK, USBPHY_CTRL_HOST_FORCE_LS_SE0(value)))
#define USBPHY_BWR_CTRL_HOST_FORCE_LS_SE0(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_HOST_FORCE_LS_SE0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field UTMI_SUSPENDM[29] (RO)
 *
 * Used by the PHY to indicate a powered-down state. If all the power-down bits
 * in the USBPHY_PWD are enabled, UTMI_SUSPENDM will be 0, otherwise 1 when USB
 * controller entering into Suspend mode. UTMI_SUSPENDM is negative logic, as
 * required by the UTMI specification.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_UTMI_SUSPENDM field. */
#define USBPHY_RD_CTRL_UTMI_SUSPENDM(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_UTMI_SUSPENDM_MASK) >> USBPHY_CTRL_UTMI_SUSPENDM_SHIFT)
#define USBPHY_BRD_CTRL_UTMI_SUSPENDM(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_UTMI_SUSPENDM_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field CLKGATE[30] (RW)
 *
 * Gate UTMI Clocks. Clear to 0 to run clocks. Set to 1 to gate clocks. Set this
 * to save power while the USB is not actively being used. Configuration state
 * is kept while the clock is gated. Note this bit can be auto-cleared if there is
 * any wakeup event when USB is suspended while ENAUTOCLR_CLKGATE bit of
 * USBPHY_CTRL is enabled.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_CLKGATE field. */
#define USBPHY_RD_CTRL_CLKGATE(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_CLKGATE_MASK) >> USBPHY_CTRL_CLKGATE_SHIFT)
#define USBPHY_BRD_CTRL_CLKGATE(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_CLKGATE_SHIFT))

/*! @brief Set the CLKGATE field to a new value. */
#define USBPHY_WR_CTRL_CLKGATE(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_CLKGATE_MASK, USBPHY_CTRL_CLKGATE(value)))
#define USBPHY_BWR_CTRL_CLKGATE(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_CLKGATE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field SFTRST[31] (RW)
 *
 * Writing a 1 to this bit will soft-reset the USBPHY_PWD, USBPHY_TX, USBPHY_RX,
 * and USBPHY_CTRL registers. Set to 0 to release the PHY from reset.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_SFTRST field. */
#define USBPHY_RD_CTRL_SFTRST(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_SFTRST_MASK) >> USBPHY_CTRL_SFTRST_SHIFT)
#define USBPHY_BRD_CTRL_SFTRST(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_SFTRST_SHIFT))

/*! @brief Set the SFTRST field to a new value. */
#define USBPHY_WR_CTRL_SFTRST(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_SFTRST_MASK, USBPHY_CTRL_SFTRST(value)))
#define USBPHY_BWR_CTRL_SFTRST(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_SFTRST_SHIFT) = (value))
/*@}*/

