RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * USBPHY_STATUS - USB PHY Status Register
 ******************************************************************************/

/*!
 * @brief USBPHY_STATUS - USB PHY Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The USB PHY Status Register holds results of IRQ and other detects.
 */
/*!
 * @name Constants and macros for entire USBPHY_STATUS register
 */
/*@{*/
#define USBPHY_RD_STATUS(base)   (USBPHY_STATUS_REG(base))
#define USBPHY_WR_STATUS(base, value) (USBPHY_STATUS_REG(base) = (value))
#define USBPHY_RMW_STATUS(base, mask, value) (USBPHY_WR_STATUS(base, (USBPHY_RD_STATUS(base) & ~(mask)) | (value)))
#define USBPHY_SET_STATUS(base, value) (USBPHY_WR_STATUS(base, USBPHY_RD_STATUS(base) |  (value)))
#define USBPHY_CLR_STATUS(base, value) (USBPHY_WR_STATUS(base, USBPHY_RD_STATUS(base) & ~(value)))
#define USBPHY_TOG_STATUS(base, value) (USBPHY_WR_STATUS(base, USBPHY_RD_STATUS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBPHY_STATUS bitfields
 */

/*!
 * @name Register USBPHY_STATUS, field HOSTDISCONDETECT_STATUS[3] (RO)
 *
 * Indicates at the local host (downstream) port that the remote device has
 * disconnected while in High-Speed mode.
 *
 * Values:
 * - 0b0 - USB cable disconnect has not been detected at the local host
 * - 0b1 - USB cable disconnect has been detected at the local host
 */
/*@{*/
/*! @brief Read current value of the USBPHY_STATUS_HOSTDISCONDETECT_STATUS field. */
#define USBPHY_RD_STATUS_HOSTDISCONDETECT_STATUS(base) ((USBPHY_STATUS_REG(base) & USBPHY_STATUS_HOSTDISCONDETECT_STATUS_MASK) >> USBPHY_STATUS_HOSTDISCONDETECT_STATUS_SHIFT)
#define USBPHY_BRD_STATUS_HOSTDISCONDETECT_STATUS(base) (BITBAND_ACCESS32(&USBPHY_STATUS_REG(base), USBPHY_STATUS_HOSTDISCONDETECT_STATUS_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_STATUS, field DEVPLUGIN_STATUS[6] (RO)
 *
 * Indicates that the device has been connected on the USB_DP and USB_DM lines
 * using the non-standard resistive plugged-in detection method controlled by
 * USBPHY_CTRL[4]. When a USB cable attached to a remote host is attached to the
 * local device, the 15kohm host pulldowns will override the high value resistors
 * used in this detection method.
 *
 * Values:
 * - 0b0 - No attachment to a USB host is detected
 * - 0b1 - Cable attachment to a USB host is detected
 */
/*@{*/
/*! @brief Read current value of the USBPHY_STATUS_DEVPLUGIN_STATUS field. */
#define USBPHY_RD_STATUS_DEVPLUGIN_STATUS(base) ((USBPHY_STATUS_REG(base) & USBPHY_STATUS_DEVPLUGIN_STATUS_MASK) >> USBPHY_STATUS_DEVPLUGIN_STATUS_SHIFT)
#define USBPHY_BRD_STATUS_DEVPLUGIN_STATUS(base) (BITBAND_ACCESS32(&USBPHY_STATUS_REG(base), USBPHY_STATUS_DEVPLUGIN_STATUS_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_STATUS, field OTGID_STATUS[8] (RW)
 *
 * Indicates the results of USB_ID pin on the USB cable plugged into the local
 * Micro- or Mini-AB receptacle. False (0) is when ID resistance to ground is less
 * than Ra_Plug_ID, indicating host (A) side. True (1) is when ID resistance is
 * greater than Rb_Plug_ID, indicating device (B) side.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_STATUS_OTGID_STATUS field. */
#define USBPHY_RD_STATUS_OTGID_STATUS(base) ((USBPHY_STATUS_REG(base) & USBPHY_STATUS_OTGID_STATUS_MASK) >> USBPHY_STATUS_OTGID_STATUS_SHIFT)
#define USBPHY_BRD_STATUS_OTGID_STATUS(base) (BITBAND_ACCESS32(&USBPHY_STATUS_REG(base), USBPHY_STATUS_OTGID_STATUS_SHIFT))

/*! @brief Set the OTGID_STATUS field to a new value. */
#define USBPHY_WR_STATUS_OTGID_STATUS(base, value) (USBPHY_RMW_STATUS(base, USBPHY_STATUS_OTGID_STATUS_MASK, USBPHY_STATUS_OTGID_STATUS(value)))
#define USBPHY_BWR_STATUS_OTGID_STATUS(base, value) (BITBAND_ACCESS32(&USBPHY_STATUS_REG(base), USBPHY_STATUS_OTGID_STATUS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_STATUS, field RESUME_STATUS[10] (RO)
 *
 * Indicates that the host is sending a wake-up after Suspend and has triggered
 * an interrupt.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_STATUS_RESUME_STATUS field. */
#define USBPHY_RD_STATUS_RESUME_STATUS(base) ((USBPHY_STATUS_REG(base) & USBPHY_STATUS_RESUME_STATUS_MASK) >> USBPHY_STATUS_RESUME_STATUS_SHIFT)
#define USBPHY_BRD_STATUS_RESUME_STATUS(base) (BITBAND_ACCESS32(&USBPHY_STATUS_REG(base), USBPHY_STATUS_RESUME_STATUS_SHIFT))
/*@}*/

/*******************************************************************************
 * USBPHY_DEBUG - USB PHY Debug Register
 ******************************************************************************/

/*!
 * @brief USBPHY_DEBUG - USB PHY Debug Register (RW)
 *
 * Reset value: 0x7F180000U
 *
 * This register is used to debug the USB PHY.
 */
/*!
 * @name Constants and macros for entire USBPHY_DEBUG register
 */
/*@{*/
#define USBPHY_RD_DEBUG(base)    (USBPHY_DEBUG_REG(base))
#define USBPHY_WR_DEBUG(base, value) (USBPHY_DEBUG_REG(base) = (value))
#define USBPHY_RMW_DEBUG(base, mask, value) (USBPHY_WR_DEBUG(base, (USBPHY_RD_DEBUG(base) & ~(mask)) | (value)))
#define USBPHY_SET_DEBUG(base, value) (USBPHY_DEBUG_SET_REG(base) = (value))
#define USBPHY_CLR_DEBUG(base, value) (USBPHY_DEBUG_CLR_REG(base) = (value))
#define USBPHY_TOG_DEBUG(base, value) (USBPHY_DEBUG_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_DEBUG bitfields
 */

/*!
 * @name Register USBPHY_DEBUG, field OTGIDPIOLOCK[0] (RW)
 *
 * Once OTG ID from USBPHY_STATUS_OTGID_STATUS is sampled, use this to hold the
 * value. This is to save power for the comparators that are used to determine
 * the ID status.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_OTGIDPIOLOCK field. */
#define USBPHY_RD_DEBUG_OTGIDPIOLOCK(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_OTGIDPIOLOCK_MASK) >> USBPHY_DEBUG_OTGIDPIOLOCK_SHIFT)
#define USBPHY_BRD_DEBUG_OTGIDPIOLOCK(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_OTGIDPIOLOCK_SHIFT))

/*! @brief Set the OTGIDPIOLOCK field to a new value. */
#define USBPHY_WR_DEBUG_OTGIDPIOLOCK(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_OTGIDPIOLOCK_MASK, USBPHY_DEBUG_OTGIDPIOLOCK(value)))
#define USBPHY_BWR_DEBUG_OTGIDPIOLOCK(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_OTGIDPIOLOCK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field DEBUG_INTERFACE_HOLD[1] (RW)
 *
 * Use holding registers to assist in timing for external UTMI interface.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_DEBUG_INTERFACE_HOLD field. */
#define USBPHY_RD_DEBUG_DEBUG_INTERFACE_HOLD(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_DEBUG_INTERFACE_HOLD_MASK) >> USBPHY_DEBUG_DEBUG_INTERFACE_HOLD_SHIFT)
#define USBPHY_BRD_DEBUG_DEBUG_INTERFACE_HOLD(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_DEBUG_INTERFACE_HOLD_SHIFT))

