RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the SQUELCHRESETLENGTH field to a new value. */
#define USBPHY_WR_DEBUG_SQUELCHRESETLENGTH(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_SQUELCHRESETLENGTH_MASK, USBPHY_DEBUG_SQUELCHRESETLENGTH(value)))
#define USBPHY_BWR_DEBUG_SQUELCHRESETLENGTH(base, value) (USBPHY_WR_DEBUG_SQUELCHRESETLENGTH(base, value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field HOST_RESUME_DEBUG[29] (RW)
 *
 * Choose to trigger the host resume SE0 with HOST_FORCE_LS_SE0 = 0 or
 * UTMI_SUSPEND = 1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_HOST_RESUME_DEBUG field. */
#define USBPHY_RD_DEBUG_HOST_RESUME_DEBUG(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_HOST_RESUME_DEBUG_MASK) >> USBPHY_DEBUG_HOST_RESUME_DEBUG_SHIFT)
#define USBPHY_BRD_DEBUG_HOST_RESUME_DEBUG(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_HOST_RESUME_DEBUG_SHIFT))

/*! @brief Set the HOST_RESUME_DEBUG field to a new value. */
#define USBPHY_WR_DEBUG_HOST_RESUME_DEBUG(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_HOST_RESUME_DEBUG_MASK, USBPHY_DEBUG_HOST_RESUME_DEBUG(value)))
#define USBPHY_BWR_DEBUG_HOST_RESUME_DEBUG(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_HOST_RESUME_DEBUG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field CLKGATE[30] (RW)
 *
 * Gate Test Clocks. Clear to 0 for running clocks. Set to 1 to gate clocks. Set
 * this to save power while the USB is not actively being used. Configuration
 * state is kept while the clock is gated.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_CLKGATE field. */
#define USBPHY_RD_DEBUG_CLKGATE(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_CLKGATE_MASK) >> USBPHY_DEBUG_CLKGATE_SHIFT)
#define USBPHY_BRD_DEBUG_CLKGATE(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_CLKGATE_SHIFT))

/*! @brief Set the CLKGATE field to a new value. */
#define USBPHY_WR_DEBUG_CLKGATE(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_CLKGATE_MASK, USBPHY_DEBUG_CLKGATE(value)))
#define USBPHY_BWR_DEBUG_CLKGATE(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_CLKGATE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBPHY_DEBUG0_STATUS - UTMI Debug Status Register 0
 ******************************************************************************/

/*!
 * @brief USBPHY_DEBUG0_STATUS - UTMI Debug Status Register 0 (RO)
 *
 * Reset value: 0x00000000U
 *
 * The UTMI Debug Status Register 0 holds multiple views for counters and status
 * of state machines. This is used in conjunction with the
 * USBPHYx_DEBUG1_DBG_ADDRESS field to choose which function to view. The default is described in the
 * bit fields below and is used to count errors.
 */
/*!
 * @name Constants and macros for entire USBPHY_DEBUG0_STATUS register
 */
/*@{*/
#define USBPHY_RD_DEBUG0_STATUS(base) (USBPHY_DEBUG0_STATUS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBPHY_DEBUG0_STATUS bitfields
 */

/*!
 * @name Register USBPHY_DEBUG0_STATUS, field LOOP_BACK_FAIL_COUNT[15:0] (RO)
 *
 * Running count of the failed pseudo-random generator loopback. Each time
 * entering testmode, counter goes to 900D and will count up for every detected packet
 * failure in digital/analog loopback tests.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT field. */
#define USBPHY_RD_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT(base) ((USBPHY_DEBUG0_STATUS_REG(base) & USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK) >> USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT)
#define USBPHY_BRD_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT(base) (USBPHY_RD_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT(base))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG0_STATUS, field UTMI_RXERROR_FAIL_COUNT[25:16] (RO)
 *
 * Running count of the UTMI_RXERROR.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT field. */
#define USBPHY_RD_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT(base) ((USBPHY_DEBUG0_STATUS_REG(base) & USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK) >> USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT)
#define USBPHY_BRD_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT(base) (USBPHY_RD_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT(base))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG0_STATUS, field SQUELCH_COUNT[31:26] (RO)
 *
 * Running count of the squelch reset instead of normal end for HS RX.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG0_STATUS_SQUELCH_COUNT field. */
#define USBPHY_RD_DEBUG0_STATUS_SQUELCH_COUNT(base) ((USBPHY_DEBUG0_STATUS_REG(base) & USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK) >> USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT)
#define USBPHY_BRD_DEBUG0_STATUS_SQUELCH_COUNT(base) (USBPHY_RD_DEBUG0_STATUS_SQUELCH_COUNT(base))
/*@}*/

/*******************************************************************************
 * USBPHY_DEBUG1 - UTMI Debug Status Register 1
 ******************************************************************************/

/*!
 * @brief USBPHY_DEBUG1 - UTMI Debug Status Register 1 (RW)
 *
 * Reset value: 0x00001000U
 *
 * Chooses the muxing of the debug register to be shown in USBPHYx_DEBUG0_STATUS.
 */
/*!
 * @name Constants and macros for entire USBPHY_DEBUG1 register
 */
/*@{*/
#define USBPHY_RD_DEBUG1(base)   (USBPHY_DEBUG1_REG(base))
#define USBPHY_WR_DEBUG1(base, value) (USBPHY_DEBUG1_REG(base) = (value))
#define USBPHY_RMW_DEBUG1(base, mask, value) (USBPHY_WR_DEBUG1(base, (USBPHY_RD_DEBUG1(base) & ~(mask)) | (value)))
#define USBPHY_SET_DEBUG1(base, value) (USBPHY_DEBUG1_SET_REG(base) = (value))
#define USBPHY_CLR_DEBUG1(base, value) (USBPHY_DEBUG1_CLR_REG(base) = (value))
#define USBPHY_TOG_DEBUG1(base, value) (USBPHY_DEBUG1_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_DEBUG1 bitfields
 */

/*!
 * @name Register USBPHY_DEBUG1, field ENTAILADJVD[14:13] (RW)
 *
 * Delay increment of the rise of squelch:
 *
 * Values:
 * - 0b00 - Delay is nominal
 * - 0b01 - Delay is +20%
 * - 0b10 - Delay is -20%
 * - 0b11 - Delay is -40%
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG1_ENTAILADJVD field. */
#define USBPHY_RD_DEBUG1_ENTAILADJVD(base) ((USBPHY_DEBUG1_REG(base) & USBPHY_DEBUG1_ENTAILADJVD_MASK) >> USBPHY_DEBUG1_ENTAILADJVD_SHIFT)
#define USBPHY_BRD_DEBUG1_ENTAILADJVD(base) (USBPHY_RD_DEBUG1_ENTAILADJVD(base))

/*! @brief Set the ENTAILADJVD field to a new value. */
#define USBPHY_WR_DEBUG1_ENTAILADJVD(base, value) (USBPHY_RMW_DEBUG1(base, USBPHY_DEBUG1_ENTAILADJVD_MASK, USBPHY_DEBUG1_ENTAILADJVD(value)))
#define USBPHY_BWR_DEBUG1_ENTAILADJVD(base, value) (USBPHY_WR_DEBUG1_ENTAILADJVD(base, value))
/*@}*/

