RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*******************************************************************************
 * USBPHY_USB1_VBUS_DETECT - USB PHY VBUS Detect Control Register
 ******************************************************************************/

/*!
 * @brief USBPHY_USB1_VBUS_DETECT - USB PHY VBUS Detect Control Register (RW)
 *
 * Reset value: 0x00700004U
 *
 * This register defines controls for USB VBUS detect and some additional out of
 * band signaling functions.
 */
/*!
 * @name Constants and macros for entire USBPHY_USB1_VBUS_DETECT register
 */
/*@{*/
#define USBPHY_RD_USB1_VBUS_DETECT(base) (USBPHY_USB1_VBUS_DETECT_REG(base))
#define USBPHY_WR_USB1_VBUS_DETECT(base, value) (USBPHY_USB1_VBUS_DETECT_REG(base) = (value))
#define USBPHY_RMW_USB1_VBUS_DETECT(base, mask, value) (USBPHY_WR_USB1_VBUS_DETECT(base, (USBPHY_RD_USB1_VBUS_DETECT(base) & ~(mask)) | (value)))
#define USBPHY_SET_USB1_VBUS_DETECT(base, value) (USBPHY_USB1_VBUS_DETECT_SET_REG(base) = (value))
#define USBPHY_CLR_USB1_VBUS_DETECT(base, value) (USBPHY_USB1_VBUS_DETECT_CLR_REG(base) = (value))
#define USBPHY_TOG_USB1_VBUS_DETECT(base, value) (USBPHY_USB1_VBUS_DETECT_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_USB1_VBUS_DETECT bitfields
 */

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUSVALID_THRESH[2:0] (RW)
 *
 * Sets the threshold for the VBUSVALID comparator. This comparator is the most
 * accurate method to determine the presence of 5v, and includes hystersis to
 * minimize the need for software debounce of the detection. This comparator has
 * ~50mV of hystersis to prevent chattering at the comparator trip point.
 *
 * Values:
 * - 0b000 - 4.0 V
 * - 0b001 - 4.1 V
 * - 0b010 - 4.2 V
 * - 0b011 - 4.3 V
 * - 0b100 - 4.4 V (Default)
 * - 0b101 - 4.5 V
 * - 0b110 - 4.6 V
 * - 0b111 - 4.7 V
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUSVALID_THRESH(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUSVALID_THRESH(base) (USBPHY_RD_USB1_VBUS_DETECT_VBUSVALID_THRESH(base))

/*! @brief Set the VBUSVALID_THRESH field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUSVALID_THRESH(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK, USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUSVALID_THRESH(base, value) (USBPHY_WR_USB1_VBUS_DETECT_VBUSVALID_THRESH(base, value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUS_OVERRIDE_EN[3] (RW)
 *
 * This bit field allows SW to override the results from the VBUS_VALID and
 * Session Valid comparators using the values in USBPHY_USB1_VBUS_DETECT[7:4]. The
 * VBUS_VALID, AVALID, BVALID, and SESSEND signals sent to the USB controller are
 * each affected by these bit selections. The values reported for AVALID, BVALID,
 * and SESSEND in USBPHY_USB1_VBUS_DET_STAT[2:0] are also affected but the value
 * reported for VBUS_VALID in USBPHY_USB1_VBUS_DET_STAT[3] is not affected. This
 * override method may be useful if VBUS detection is not done with the internal
 * VBUS_VALID or Session End comparators.
 *
 * Values:
 * - 0b0 - Use the results of the internal VBUS_VALID and Session Valid
 *     comparators for VBUS_VALID, AVALID, BVALID, and SESSEND (Default)
 * - 0b1 - Use the override values for VBUS_VALID, AVALID, BVALID, and SESSEND
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_SHIFT))

/*! @brief Set the VBUS_OVERRIDE_EN field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_MASK, USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field SESSEND_OVERRIDE[4] (RW)
 *
 * The bit field provides the value for USBPHY_USB1_VBUS_DET_STAT[0] if
 * USBPHY_USB_VBUS_DETECT[3] is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE field. */
#define USBPHY_RD_USB1_VBUS_DETECT_SESSEND_OVERRIDE(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_MASK) >> USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_SESSEND_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_SHIFT))

/*! @brief Set the SESSEND_OVERRIDE field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_SESSEND_OVERRIDE(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_MASK, USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_SESSEND_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field BVALID_OVERRIDE[5] (RW)
 *
 * The bit field provides the value for USBPHY_USB1_VBUS_DET_STAT[1] if
 * USBPHY_USB_VBUS_DETECT[3] is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE field. */
#define USBPHY_RD_USB1_VBUS_DETECT_BVALID_OVERRIDE(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_MASK) >> USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_BVALID_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_SHIFT))

/*! @brief Set the BVALID_OVERRIDE field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_BVALID_OVERRIDE(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_MASK, USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_BVALID_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field AVALID_OVERRIDE[6] (RW)
 *
 * The bit field provides the value for USBPHY_USB1_VBUS_DET_STAT[2] if
 * USBPHY_USB_VBUS_DETECT[3] is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE field. */
#define USBPHY_RD_USB1_VBUS_DETECT_AVALID_OVERRIDE(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_MASK) >> USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_AVALID_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_SHIFT))

/*! @brief Set the AVALID_OVERRIDE field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_AVALID_OVERRIDE(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_MASK, USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_AVALID_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUSVALID_OVERRIDE[7] (RW)
 *
 * The bit field provides the value for VBUS_VALID reported to the USB
 * controller if the value of USBPHY_USB1_VBUS_DETECT[3] is set to 1'b1. The value of this
 * bit field does not affect the value of USBPHY_USB1_VBUS_DET_STAT[3].
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_SHIFT))

