RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18_extension.h
/*! @brief Set the VBUSVALID_OVERRIDE field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_MASK, USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUSVALID_SEL[8] (RW)
 *
 * This is one of the bit fields that selects the source of the VBUS_VALID
 * signal reported to the USB controller. The VBUS_VALID source selection in this bit
 * field only takes effect if USBPHY_USB1_VBUS_DETECT[3] has the value 1'b0. This
 * bit field does not impact the VBUS_VALID value reported in
 * USBPHY_USB1_VBUS_DET_STAT[3].
 *
 * Values:
 * - 0b0 - Use the VBUS_VALID comparator results for signal reported to the USB
 *     controller (Default)
 * - 0b1 - Use the VBUS_VALID_3V detector results for signal reported to the USB
 *     controller
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUSVALID_SEL(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUSVALID_SEL(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_SHIFT))

/*! @brief Set the VBUSVALID_SEL field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUSVALID_SEL(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_MASK, USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUSVALID_SEL(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUS_SOURCE_SEL[10:9] (RW)
 *
 * This is one of the bit fields that selects the source of the VBUS_VALID
 * signal reported to the USB controller. The VBUS_VALID source selections in this bit
 * field only take effect if both USBPHY_USB1_VBUS_DETECT[8] and
 * USBPHY_USB1_VBUS_DETECT[3] each have the value 1'b0. This bit field does not impact the
 * VBUS_VALID value reported in USBPHY_USB1_VBUS_DET_STAT[3].
 *
 * Values:
 * - 0b00 - Use the VBUS_VALID comparator results for signal reported to the USB
 *     controller (Default)
 * - 0b01 - Use the Session Valid comparator results for signal reported to the
 *     USB controller
 * - 0b10 - Use the Session Valid comparator results for signal reported to the
 *     USB controller
 * - 0b11 - Reserved, do not use
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base) (USBPHY_RD_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base))

/*! @brief Set the VBUS_SOURCE_SEL field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_MASK, USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base, value) (USBPHY_WR_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field VBUSVALID_TO_SESSVALID[18] (RW)
 *
 * This bit field controls the comparator used to report the VBUS_VALID results
 * in USBPHY_USB1_VBUS_DETECT[3] between the VBUS_VALID comparator and the
 * Session Valid comparator. The VBUS_VALID comparator is the most accurate and has a
 * programmable threshold set by USBPHY_USB_VBUS_DETECT[2:0]. The Session Valid
 * comparator may be useful in systems using non-standard VBUS voltages. The mux
 * selection in this bit field happens before any VBUS_VALID selection controlled
 * by the USBPHY_USB1_VBUS_DETECT[10:8] bits.
 *
 * Values:
 * - 0b0 - Use the VBUS_VALID comparator for VBUS_VALID results
 * - 0b1 - Use the Session End comparator for VBUS_VALID results. The Session
 *     End threshold is >0.8V and <4.0V.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID field. */
#define USBPHY_RD_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_MASK) >> USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT))

/*! @brief Set the VBUSVALID_TO_SESSVALID field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_MASK, USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field PWRUP_CMPS[20] (RW)
 *
 * Powers up the comparator used for the VBUS_VALID detector. This bit field can
 * be reset to value 1'b0 to save power if the internal VBUS_VALID comparator is
 * not used.
 *
 * Values:
 * - 0b0 - Powers down the VBUS_VALID comparator
 * - 0b1 - Enables the VBUS_VALID comparator (default)
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS field. */
#define USBPHY_RD_USB1_VBUS_DETECT_PWRUP_CMPS(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK) >> USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_PWRUP_CMPS(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT))

/*! @brief Set the PWRUP_CMPS field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_PWRUP_CMPS(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK, USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_PWRUP_CMPS(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field DISCHARGE_VBUS[26] (RW)
 *
 * This bit field controls a nominal 22kohm resistor between the USB1_VBUS pin
 * and ground. It can be used to accelerate the fall of the VBUS signal at the end
 * of a session.
 *
 * Values:
 * - 0b0 - VBUS discharge resistor is disabled (Default)
 * - 0b1 - VBUS discharge resistor is enabled
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS field. */
#define USBPHY_RD_USB1_VBUS_DETECT_DISCHARGE_VBUS(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_MASK) >> USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_DISCHARGE_VBUS(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT))

/*! @brief Set the DISCHARGE_VBUS field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_DISCHARGE_VBUS(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_MASK, USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_DISCHARGE_VBUS(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DETECT, field EN_CHARGER_RESISTOR[31] (RW)
 *
 * This bit field enables a nominal 125kohm pullup on USB_DP and a nominal
 * 375kohm pulldown on USB_DM. This allows resistive battery charger detection per the
 * USB Battery Charging Specification Revision 1.0 which is now obsolete.
 * Detection of USB_DP and USB_DM pin states using this method is done with the
 * USBPHY_CHRG_DET_STAT[3:2] bit fields. This bit field must remain at a value of 1'b0
 * for normal USB data communication, or when using the USBHSDCD module for
 * battery charger detection per the USB Battery Charger Specification Revision 1.2 or
 * any other detection mechanism for USB cable plugin.
 *
 * Values:
 * - 0b0 - Disable resistive charger detection resistors on USB_DP and USB_DP
 * - 0b1 - Enable resistive charger detection resistors on USB_DP and USB_DP
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR field. */
#define USBPHY_RD_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(base) ((USBPHY_USB1_VBUS_DETECT_REG(base) & USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_MASK) >> USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_SHIFT))

/*! @brief Set the EN_CHARGER_RESISTOR field to a new value. */
#define USBPHY_WR_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(base, value) (USBPHY_RMW_USB1_VBUS_DETECT(base, USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_MASK, USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(value)))
#define USBPHY_BWR_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DETECT_REG(base), USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_SHIFT) = (value))
/*@}*/

